mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
/*******************************************************************************
* BT Registers BT14
*   Register Definition
*******************************************************************************/
#define FM_BT14_PPG_PRLL                          *((volatile uint16_t*)(0x40025680UL))
#define FM4_BT14_PPG_PRLL                         *((volatile uint16_t*)(0x40025680UL))
#define FM_BT14_PWM_PCSR                          *((volatile uint16_t*)(0x40025680UL))
#define FM4_BT14_PWM_PCSR                         *((volatile uint16_t*)(0x40025680UL))
#define FM_BT14_RT_PCSR                           *((volatile uint16_t*)(0x40025680UL))
#define FM4_BT14_RT_PCSR                          *((volatile uint16_t*)(0x40025680UL))
#define FM_BT14_PPG_PRLH                          *((volatile uint16_t*)(0x40025684UL))
#define FM4_BT14_PPG_PRLH                         *((volatile uint16_t*)(0x40025684UL))
#define FM_BT14_PWC_DTBF                          *((volatile uint16_t*)(0x40025684UL))
#define FM4_BT14_PWC_DTBF                         *((volatile uint16_t*)(0x40025684UL))
#define FM_BT14_PWM_PDUT                          *((volatile uint16_t*)(0x40025684UL))
#define FM4_BT14_PWM_PDUT                         *((volatile uint16_t*)(0x40025684UL))
#define FM_BT14_PPG_TMR                           *((volatile uint16_t*)(0x40025688UL))
#define FM4_BT14_PPG_TMR                          *((volatile uint16_t*)(0x40025688UL))
#define FM_BT14_PWM_TMR                           *((volatile uint16_t*)(0x40025688UL))
#define FM4_BT14_PWM_TMR                          *((volatile uint16_t*)(0x40025688UL))
#define FM_BT14_RT_TMR                            *((volatile uint16_t*)(0x40025688UL))
#define FM4_BT14_RT_TMR                           *((volatile uint16_t*)(0x40025688UL))
#define FM_BT14_PPG_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_PPG_TMCR                         *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_PWC_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_PWC_TMCR                         *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_PWM_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_PWM_TMCR                         *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_RT_TMCR                           *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_RT_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_PPG_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_PPG_STC                          *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_PWC_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_PWC_STC                          *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_PWM_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_PWM_STC                          *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_RT_STC                            *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_RT_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025691UL))
#define FM_BT14_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025691UL))
#define FM_BT14_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025691UL))
#define FM_BT14_RT_TMCR2                          *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_RT_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))

/*******************************************************************************
* BT Registers BT15
*   Register Definition
*******************************************************************************/
#define FM_BT15_PPG_PRLL                          *((volatile uint16_t*)(0x400256C0UL))
#define FM4_BT15_PPG_PRLL                         *((volatile uint16_t*)(0x400256C0UL))
#define FM_BT15_PWM_PCSR                          *((volatile uint16_t*)(0x400256C0UL))
#define FM4_BT15_PWM_PCSR                         *((volatile uint16_t*)(0x400256C0UL))
#define FM_BT15_RT_PCSR                           *((volatile uint16_t*)(0x400256C0UL))
#define FM4_BT15_RT_PCSR                          *((volatile uint16_t*)(0x400256C0UL))
#define FM_BT15_PPG_PRLH                          *((volatile uint16_t*)(0x400256C4UL))
#define FM4_BT15_PPG_PRLH                         *((volatile uint16_t*)(0x400256C4UL))
#define FM_BT15_PWC_DTBF                          *((volatile uint16_t*)(0x400256C4UL))
#define FM4_BT15_PWC_DTBF                         *((volatile uint16_t*)(0x400256C4UL))
#define FM_BT15_PWM_PDUT                          *((volatile uint16_t*)(0x400256C4UL))
#define FM4_BT15_PWM_PDUT                         *((volatile uint16_t*)(0x400256C4UL))
#define FM_BT15_PPG_TMR                           *((volatile uint16_t*)(0x400256C8UL))
#define FM4_BT15_PPG_TMR                          *((volatile uint16_t*)(0x400256C8UL))
#define FM_BT15_PWM_TMR                           *((volatile uint16_t*)(0x400256C8UL))
#define FM4_BT15_PWM_TMR                          *((volatile uint16_t*)(0x400256C8UL))
#define FM_BT15_RT_TMR                            *((volatile uint16_t*)(0x400256C8UL))
#define FM4_BT15_RT_TMR                           *((volatile uint16_t*)(0x400256C8UL))
#define FM_BT15_PPG_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_PPG_TMCR                         *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_PWC_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_PWC_TMCR                         *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_PWM_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_PWM_TMCR                         *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_RT_TMCR                           *((volatile uint16_t*)(0x400256CCUL))
#define FM4_BT15_RT_TMCR                          *((volatile uint16_t*)(0x400256CCUL))
#define FM_BT15_PPG_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_PPG_STC                          *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_PWC_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_PWC_STC                          *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_PWM_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_PWM_STC                          *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_RT_STC                            *((volatile  uint8_t*)(0x400256D0UL))
#define FM4_BT15_RT_STC                           *((volatile  uint8_t*)(0x400256D0UL))
#define FM_BT15_PPG_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_PPG_TMCR2                        *((volatile  uint8_t*)(0x400256D1UL))
#define FM_BT15_PWC_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_PWC_TMCR2                        *((volatile  uint8_t*)(0x400256D1UL))
#define FM_BT15_PWM_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_PWM_TMCR2                        *((volatile  uint8_t*)(0x400256D1UL))
#define FM_BT15_RT_TMCR2                          *((volatile  uint8_t*)(0x400256D1UL))
#define FM4_BT15_RT_TMCR2                         *((volatile  uint8_t*)(0x400256D1UL))

