mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
/*******************************************************************************
* MFS Registers MFS10
*   Register Definition
*******************************************************************************/
#define FM_MFS10_CSIO_SMR                         *((volatile  uint8_t*)(0x40038A00UL))
#define FM4_MFS10_CSIO_SMR                        *((volatile  uint8_t*)(0x40038A00UL))
#define FM_MFS10_I2C_SMR                          *((volatile  uint8_t*)(0x40038A00UL))
#define FM4_MFS10_I2C_SMR                         *((volatile  uint8_t*)(0x40038A00UL))
#define FM_MFS10_LIN_SMR                          *((volatile  uint8_t*)(0x40038A00UL))
#define FM4_MFS10_LIN_SMR                         *((volatile  uint8_t*)(0x40038A00UL))
#define FM_MFS10_UART_SMR                         *((volatile  uint8_t*)(0x40038A00UL))
#define FM4_MFS10_UART_SMR                        *((volatile  uint8_t*)(0x40038A00UL))
#define FM_MFS10_CSIO_SCR                         *((volatile  uint8_t*)(0x40038A01UL))
#define FM4_MFS10_CSIO_SCR                        *((volatile  uint8_t*)(0x40038A01UL))
#define FM_MFS10_I2C_IBCR                         *((volatile  uint8_t*)(0x40038A01UL))
#define FM4_MFS10_I2C_IBCR                        *((volatile  uint8_t*)(0x40038A01UL))
#define FM_MFS10_LIN_SCR                          *((volatile  uint8_t*)(0x40038A01UL))
#define FM4_MFS10_LIN_SCR                         *((volatile  uint8_t*)(0x40038A01UL))
#define FM_MFS10_UART_SCR                         *((volatile  uint8_t*)(0x40038A01UL))
#define FM4_MFS10_UART_SCR                        *((volatile  uint8_t*)(0x40038A01UL))
#define FM_MFS10_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038A04UL))
#define FM4_MFS10_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038A04UL))
#define FM_MFS10_I2C_IBSR                         *((volatile  uint8_t*)(0x40038A04UL))
#define FM4_MFS10_I2C_IBSR                        *((volatile  uint8_t*)(0x40038A04UL))
#define FM_MFS10_LIN_ESCR                         *((volatile  uint8_t*)(0x40038A04UL))
#define FM4_MFS10_LIN_ESCR                        *((volatile  uint8_t*)(0x40038A04UL))
#define FM_MFS10_UART_ESCR                        *((volatile  uint8_t*)(0x40038A04UL))
#define FM4_MFS10_UART_ESCR                       *((volatile  uint8_t*)(0x40038A04UL))
#define FM_MFS10_CSIO_SSR                         *((volatile  uint8_t*)(0x40038A05UL))
#define FM4_MFS10_CSIO_SSR                        *((volatile  uint8_t*)(0x40038A05UL))
#define FM_MFS10_I2C_SSR                          *((volatile  uint8_t*)(0x40038A05UL))
#define FM4_MFS10_I2C_SSR                         *((volatile  uint8_t*)(0x40038A05UL))
#define FM_MFS10_LIN_SSR                          *((volatile  uint8_t*)(0x40038A05UL))
#define FM4_MFS10_LIN_SSR                         *((volatile  uint8_t*)(0x40038A05UL))
#define FM_MFS10_UART_SSR                         *((volatile  uint8_t*)(0x40038A05UL))
#define FM4_MFS10_UART_SSR                        *((volatile  uint8_t*)(0x40038A05UL))
#define FM_MFS10_CSIO_RDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_CSIO_RDR                        *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_CSIO_TDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_CSIO_TDR                        *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_I2C_RDR                          *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_I2C_RDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_I2C_TDR                          *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_I2C_TDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_LIN_RDR                          *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_LIN_RDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_LIN_TDR                          *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_LIN_TDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_UART_RDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_UART_RDR                        *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_UART_TDR                         *((volatile uint16_t*)(0x40038A08UL))
#define FM4_MFS10_UART_TDR                        *((volatile uint16_t*)(0x40038A08UL))
#define FM_MFS10_CSIO_BGR                         *((volatile uint16_t*)(0x40038A0CUL))
#define FM4_MFS10_CSIO_BGR                        *((volatile uint16_t*)(0x40038A0CUL))
#define FM_MFS10_I2C_BGR                          *((volatile uint16_t*)(0x40038A0CUL))
#define FM4_MFS10_I2C_BGR                         *((volatile uint16_t*)(0x40038A0CUL))
#define FM_MFS10_LIN_BGR                          *((volatile uint16_t*)(0x40038A0CUL))
#define FM4_MFS10_LIN_BGR                         *((volatile uint16_t*)(0x40038A0CUL))
#define FM_MFS10_UART_BGR                         *((volatile uint16_t*)(0x40038A0CUL))
#define FM4_MFS10_UART_BGR                        *((volatile uint16_t*)(0x40038A0CUL))
#define FM_MFS10_I2C_ISBA                         *((volatile  uint8_t*)(0x40038A10UL))
#define FM4_MFS10_I2C_ISBA                        *((volatile  uint8_t*)(0x40038A10UL))
#define FM_MFS10_I2C_ISMK                         *((volatile  uint8_t*)(0x40038A11UL))
#define FM4_MFS10_I2C_ISMK                        *((volatile  uint8_t*)(0x40038A11UL))
#define FM_MFS10_CSIO_FCR                         *((volatile uint16_t*)(0x40038A14UL))
#define FM4_MFS10_CSIO_FCR                        *((volatile uint16_t*)(0x40038A14UL))
#define FM_MFS10_I2C_FCR                          *((volatile uint16_t*)(0x40038A14UL))
#define FM4_MFS10_I2C_FCR                         *((volatile uint16_t*)(0x40038A14UL))
#define FM_MFS10_LIN_FCR                          *((volatile uint16_t*)(0x40038A14UL))
#define FM4_MFS10_LIN_FCR                         *((volatile uint16_t*)(0x40038A14UL))
#define FM_MFS10_UART_FCR                         *((volatile uint16_t*)(0x40038A14UL))
#define FM4_MFS10_UART_FCR                        *((volatile uint16_t*)(0x40038A14UL))
#define FM_MFS10_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038A18UL))
#define FM4_MFS10_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038A18UL))
#define FM_MFS10_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038A18UL))
#define FM4_MFS10_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038A18UL))
#define FM_MFS10_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038A18UL))
#define FM4_MFS10_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038A18UL))
#define FM_MFS10_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038A18UL))
#define FM4_MFS10_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038A18UL))
#define FM_MFS10_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038A19UL))
#define FM4_MFS10_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038A19UL))
#define FM_MFS10_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038A19UL))
#define FM4_MFS10_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038A19UL))
#define FM_MFS10_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038A19UL))
#define FM4_MFS10_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038A19UL))
#define FM_MFS10_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038A19UL))
#define FM4_MFS10_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038A19UL))
#define FM_MFS10_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x40038A1CUL))
#define FM4_MFS10_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x40038A1CUL))
#define FM_MFS10_I2C_NFCR                         *((volatile  uint8_t*)(0x40038A1CUL))
#define FM4_MFS10_I2C_NFCR                        *((volatile  uint8_t*)(0x40038A1CUL))
#define FM_MFS10_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x40038A1DUL))
#define FM4_MFS10_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x40038A1DUL))
#define FM_MFS10_I2C_EIBCR                        *((volatile  uint8_t*)(0x40038A1DUL))
#define FM4_MFS10_I2C_EIBCR                       *((volatile  uint8_t*)(0x40038A1DUL))
#define FM_MFS10_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038A20UL))
#define FM4_MFS10_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038A20UL))
#define FM_MFS10_CSIO_SACSR                       *((volatile uint16_t*)(0x40038A24UL))
#define FM4_MFS10_CSIO_SACSR                      *((volatile uint16_t*)(0x40038A24UL))
#define FM_MFS10_CSIO_STMR                        *((volatile uint16_t*)(0x40038A28UL))
#define FM4_MFS10_CSIO_STMR                       *((volatile uint16_t*)(0x40038A28UL))
#define FM_MFS10_CSIO_STMCR                       *((volatile uint16_t*)(0x40038A2CUL))
#define FM4_MFS10_CSIO_STMCR                      *((volatile uint16_t*)(0x40038A2CUL))
#define FM_MFS10_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038A30UL))
#define FM4_MFS10_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038A30UL))
#define FM_MFS10_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038A34UL))
#define FM4_MFS10_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038A34UL))
#define FM_MFS10_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038A35UL))
#define FM4_MFS10_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038A35UL))
#define FM_MFS10_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038A38UL))
#define FM4_MFS10_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038A38UL))
#define FM_MFS10_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x40038A3CUL))
#define FM4_MFS10_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x40038A3CUL))
#define FM_MFS10_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x40038A3DUL))
#define FM4_MFS10_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x40038A3DUL))
#define FM_MFS10_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038A40UL))
#define FM4_MFS10_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038A40UL))
#define FM_MFS10_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038A41UL))
#define FM4_MFS10_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038A41UL))

