mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
/*******************************************************************************
* SWWDT Registers SWWDT
*   Register Definition
*******************************************************************************/
#define FM_SWWDT_WDOGLOAD                         *((volatile uint32_t*)(0x40012000UL))
#define FM4_SWWDT_WDOGLOAD                        *((volatile uint32_t*)(0x40012000UL))
#define FM_SWWDT_WDOGVALUE                        *((volatile uint32_t*)(0x40012004UL))
#define FM4_SWWDT_WDOGVALUE                       *((volatile uint32_t*)(0x40012004UL))
#define FM_SWWDT_WDOGCONTROL                      *((volatile uint32_t*)(0x40012008UL))
#define FM4_SWWDT_WDOGCONTROL                     *((volatile uint32_t*)(0x40012008UL))
#define FM_SWWDT_WDOGINTCLR                       *((volatile uint32_t*)(0x4001200CUL))
#define FM4_SWWDT_WDOGINTCLR                      *((volatile uint32_t*)(0x4001200CUL))
#define FM_SWWDT_WDOGRIS                          *((volatile uint32_t*)(0x40012010UL))
#define FM4_SWWDT_WDOGRIS                         *((volatile uint32_t*)(0x40012010UL))
#define FM_SWWDT_WDOGSPMC                         *((volatile uint32_t*)(0x40012018UL))
#define FM4_SWWDT_WDOGSPMC                        *((volatile uint32_t*)(0x40012018UL))
#define FM_SWWDT_WDOGLOCK                         *((volatile uint32_t*)(0x40012C00UL))
#define FM4_SWWDT_WDOGLOCK                        *((volatile uint32_t*)(0x40012C00UL))

/*******************************************************************************
* UNIQUE_ID Registers UNIQUE_ID
*   Register Definition
*******************************************************************************/
#define FM_UNIQUE_ID_UIDR0                        *((volatile uint32_t*)(0x40000200UL))
#define FM4_UNIQUE_ID_UIDR0                       *((volatile uint32_t*)(0x40000200UL))
#define FM_UNIQUE_ID_UIDR1                        *((volatile uint32_t*)(0x40000204UL))
#define FM4_UNIQUE_ID_UIDR1                       *((volatile uint32_t*)(0x40000204UL))

/*******************************************************************************
* WC Registers WC
*   Register Definition
*******************************************************************************/
#define FM_WC_WCRD                                *((volatile  uint8_t*)(0x4003A000UL))
#define FM4_WC_WCRD                               *((volatile  uint8_t*)(0x4003A000UL))
#define FM_WC_WCRL                                *((volatile  uint8_t*)(0x4003A001UL))
#define FM4_WC_WCRL                               *((volatile  uint8_t*)(0x4003A001UL))
#define FM_WC_WCCR                                *((volatile  uint8_t*)(0x4003A002UL))
#define FM4_WC_WCCR                               *((volatile  uint8_t*)(0x4003A002UL))
#define FM_WC_CLK_SEL                             *((volatile uint16_t*)(0x4003A010UL))
#define FM4_WC_CLK_SEL                            *((volatile uint16_t*)(0x4003A010UL))
#define FM_WC_CLK_EN                              *((volatile  uint8_t*)(0x4003A014UL))
#define FM4_WC_CLK_EN                             *((volatile  uint8_t*)(0x4003A014UL))

/*******************************************************************************
* Available Registers
*******************************************************************************/
/*******************************************************************************
* ADC0
*******************************************************************************/
#define FM4_ADC_ADCEN_AVAILABLE                   1
#define FM_ADC_ADCEN_AVAILABLE                    1
#define FM4_ADC_ADCR_AVAILABLE                    1
#define FM_ADC_ADCR_AVAILABLE                     1
#define FM4_ADC_ADCT_AVAILABLE                    1
#define FM_ADC_ADCT_AVAILABLE                     1
#define FM4_ADC_ADSR_AVAILABLE                    1
#define FM_ADC_ADSR_AVAILABLE                     1
#define FM4_ADC_ADSS01_AVAILABLE                  1
#define FM_ADC_ADSS01_AVAILABLE                   1
#define FM4_ADC_ADSS23_AVAILABLE                  1
#define FM_ADC_ADSS23_AVAILABLE                   1
#define FM4_ADC_ADST01_AVAILABLE                  1
#define FM_ADC_ADST01_AVAILABLE                   1
#define FM4_ADC_CALSR_AVAILABLE                   1
#define FM_ADC_CALSR_AVAILABLE                    1
#define FM4_ADC_CMPCR_AVAILABLE                   1
#define FM_ADC_CMPCR_AVAILABLE                    1
#define FM4_ADC_CMPD_AVAILABLE                    1
#define FM_ADC_CMPD_AVAILABLE                     1
#define FM4_ADC_PCCR_AVAILABLE                    1
#define FM_ADC_PCCR_AVAILABLE                     1
#define FM4_ADC_PCFD_AVAILABLE                    1
#define FM_ADC_PCFD_AVAILABLE                     1
#define FM4_ADC_PCFD_FDAS1_AVAILABLE              1
#define FM_ADC_PCFD_FDAS1_AVAILABLE               1
#define FM4_ADC_PCIS_AVAILABLE                    1
#define FM_ADC_PCIS_AVAILABLE                     1
#define FM4_ADC_PFNS_AVAILABLE                    1
#define FM_ADC_PFNS_AVAILABLE                     1
#define FM4_ADC_PRTSL_AVAILABLE                   1
#define FM_ADC_PRTSL_AVAILABLE                    1
#define FM4_ADC_SCCR_AVAILABLE                    1
#define FM_ADC_SCCR_AVAILABLE                     1
#define FM4_ADC_SCFD_AVAILABLE                    1
#define FM_ADC_SCFD_AVAILABLE                     1
#define FM4_ADC_SCFD_FDAS1_AVAILABLE              1
#define FM_ADC_SCFD_FDAS1_AVAILABLE               1
#define FM4_ADC_SCIS01_AVAILABLE                  1
#define FM_ADC_SCIS01_AVAILABLE                   1
#define FM4_ADC_SCIS23_AVAILABLE                  1
#define FM_ADC_SCIS23_AVAILABLE                   1
#define FM4_ADC_SCTSL_AVAILABLE                   1
#define FM_ADC_SCTSL_AVAILABLE                    1
#define FM4_ADC_SFNS_AVAILABLE                    1
#define FM_ADC_SFNS_AVAILABLE                     1
#define FM4_ADC_WCMPCR_AVAILABLE                  1
#define FM_ADC_WCMPCR_AVAILABLE                   1
#define FM4_ADC_WCMPDH_AVAILABLE                  1
#define FM_ADC_WCMPDH_AVAILABLE                   1
#define FM4_ADC_WCMPDL_AVAILABLE                  1
#define FM_ADC_WCMPDL_AVAILABLE                   1
#define FM4_ADC_WCMPSR_AVAILABLE                  1
#define FM_ADC_WCMPSR_AVAILABLE                   1
#define FM4_ADC_WCMRCIF_AVAILABLE                 1
#define FM_ADC_WCMRCIF_AVAILABLE                  1
#define FM4_ADC_WCMRCOT_AVAILABLE                 1
#define FM_ADC_WCMRCOT_AVAILABLE                  1
/*******************************************************************************
* BT0
*******************************************************************************/
#define FM4_BT_PPG_PRLH_AVAILABLE                 1
#define FM_BT_PPG_PRLH_AVAILABLE                  1
#define FM4_BT_PPG_PRLL_AVAILABLE                 1
#define FM_BT_PPG_PRLL_AVAILABLE                  1
#define FM4_BT_PPG_STC_AVAILABLE                  1
#define FM_BT_PPG_STC_AVAILABLE                   1
#define FM4_BT_PPG_TMCR_AVAILABLE                 1
#define FM_BT_PPG_TMCR_AVAILABLE                  1
#define FM4_BT_PPG_TMCR2_AVAILABLE                1
#define FM_BT_PPG_TMCR2_AVAILABLE                 1
#define FM4_BT_PPG_TMR_AVAILABLE                  1
#define FM_BT_PPG_TMR_AVAILABLE                   1
#define FM4_BT_PWC_DTBF_AVAILABLE                 1
#define FM_BT_PWC_DTBF_AVAILABLE                  1
#define FM4_BT_PWC_STC_AVAILABLE                  1
#define FM_BT_PWC_STC_AVAILABLE                   1
#define FM4_BT_PWC_TMCR_AVAILABLE                 1
#define FM_BT_PWC_TMCR_AVAILABLE                  1
#define FM4_BT_PWC_TMCR2_AVAILABLE                1
#define FM_BT_PWC_TMCR2_AVAILABLE                 1
#define FM4_BT_PWM_PCSR_AVAILABLE                 1
#define FM_BT_PWM_PCSR_AVAILABLE                  1
#define FM4_BT_PWM_PDUT_AVAILABLE                 1
#define FM_BT_PWM_PDUT_AVAILABLE                  1
#define FM4_BT_PWM_STC_AVAILABLE                  1
#define FM_BT_PWM_STC_AVAILABLE                   1
#define FM4_BT_PWM_TMCR_AVAILABLE                 1
#define FM_BT_PWM_TMCR_AVAILABLE                  1
#define FM4_BT_PWM_TMCR2_AVAILABLE                1
#define FM_BT_PWM_TMCR2_AVAILABLE                 1
#define FM4_BT_PWM_TMR_AVAILABLE                  1
#define FM_BT_PWM_TMR_AVAILABLE                   1
#define FM4_BT_RT_PCSR_AVAILABLE                  1
#define FM_BT_RT_PCSR_AVAILABLE                   1
#define FM4_BT_RT_STC_AVAILABLE                   1
#define FM_BT_RT_STC_AVAILABLE                    1
#define FM4_BT_RT_TMCR_AVAILABLE                  1
#define FM_BT_RT_TMCR_AVAILABLE                   1
#define FM4_BT_RT_TMCR2_AVAILABLE                 1
#define FM_BT_RT_TMCR2_AVAILABLE                  1
#define FM4_BT_RT_TMR_AVAILABLE                   1
#define FM_BT_RT_TMR_AVAILABLE                    1
/*******************************************************************************
* BTIOSEL03
*******************************************************************************/
#define FM4_BTIOSEL03_BTSEL0123_AVAILABLE         1
#define FM_BTIOSEL03_BTSEL0123_AVAILABLE          1
/*******************************************************************************
* BTIOSEL47
*******************************************************************************/
#define FM4_BTIOSEL47_BTSEL4567_AVAILABLE         1
#define FM_BTIOSEL47_BTSEL4567_AVAILABLE          1
/*******************************************************************************
* BTIOSEL8B
*******************************************************************************/
#define FM4_BTIOSEL8B_BTSEL89AB_AVAILABLE         1
#define FM_BTIOSEL8B_BTSEL89AB_AVAILABLE          1
/*******************************************************************************
* BTIOSELCF
*******************************************************************************/
#define FM4_BTIOSELCF_BTSELCDEF_AVAILABLE         1
#define FM_BTIOSELCF_BTSELCDEF_AVAILABLE          1
/*******************************************************************************
* CAN0
*******************************************************************************/
#define FM4_CAN_BRPER_AVAILABLE                   1
#define FM_CAN_BRPER_AVAILABLE                    1
#define FM4_CAN_BTR_AVAILABLE                     1
#define FM_CAN_BTR_AVAILABLE                      1
#define FM4_CAN_CTRLR_AVAILABLE                   1
#define FM_CAN_CTRLR_AVAILABLE                    1
#define FM4_CAN_ERRCNT_AVAILABLE                  1
#define FM_CAN_ERRCNT_AVAILABLE                   1
#define FM4_CAN_IF1ARB_AVAILABLE                  1
#define FM_CAN_IF1ARB_AVAILABLE                   1
#define FM4_CAN_IF1CMSK_AVAILABLE                 1
#define FM_CAN_IF1CMSK_AVAILABLE                  1
#define FM4_CAN_IF1CREQ_AVAILABLE                 1
#define FM_CAN_IF1CREQ_AVAILABLE                  1
#define FM4_CAN_IF1DTA_B_AVAILABLE                1
#define FM_CAN_IF1DTA_B_AVAILABLE                 1
#define FM4_CAN_IF1DTA_L_AVAILABLE                1
#define FM_CAN_IF1DTA_L_AVAILABLE                 1
#define FM4_CAN_IF1DTB_B_AVAILABLE                1
#define FM_CAN_IF1DTB_B_AVAILABLE                 1
#define FM4_CAN_IF1DTB_L_AVAILABLE                1
#define FM_CAN_IF1DTB_L_AVAILABLE                 1
#define FM4_CAN_IF1MCTR_AVAILABLE                 1
#define FM_CAN_IF1MCTR_AVAILABLE                  1
#define FM4_CAN_IF1MSK_AVAILABLE                  1
#define FM_CAN_IF1MSK_AVAILABLE                   1
#define FM4_CAN_IF2ARB_AVAILABLE                  1
#define FM_CAN_IF2ARB_AVAILABLE                   1
#define FM4_CAN_IF2CMSK_AVAILABLE                 1
#define FM_CAN_IF2CMSK_AVAILABLE                  1
#define FM4_CAN_IF2CREQ_AVAILABLE                 1
#define FM_CAN_IF2CREQ_AVAILABLE                  1
#define FM4_CAN_IF2DTA_B_AVAILABLE                1
#define FM_CAN_IF2DTA_B_AVAILABLE                 1
#define FM4_CAN_IF2DTA_L_AVAILABLE                1
#define FM_CAN_IF2DTA_L_AVAILABLE                 1
#define FM4_CAN_IF2DTB_B_AVAILABLE                1
#define FM_CAN_IF2DTB_B_AVAILABLE                 1
#define FM4_CAN_IF2DTB_L_AVAILABLE                1
#define FM_CAN_IF2DTB_L_AVAILABLE                 1
#define FM4_CAN_IF2MCTR_AVAILABLE                 1
#define FM_CAN_IF2MCTR_AVAILABLE                  1
#define FM4_CAN_IF2MSK_AVAILABLE                  1
#define FM_CAN_IF2MSK_AVAILABLE                   1
#define FM4_CAN_INTPND_AVAILABLE                  1
#define FM_CAN_INTPND_AVAILABLE                   1
#define FM4_CAN_INTR_AVAILABLE                    1
#define FM_CAN_INTR_AVAILABLE                     1
#define FM4_CAN_MSGVAL_AVAILABLE                  1
#define FM_CAN_MSGVAL_AVAILABLE                   1
#define FM4_CAN_NEWDT_AVAILABLE                   1
#define FM_CAN_NEWDT_AVAILABLE                    1
#define FM4_CAN_STATR_AVAILABLE                   1
#define FM_CAN_STATR_AVAILABLE                    1
#define FM4_CAN_TESTR_AVAILABLE                   1
#define FM_CAN_TESTR_AVAILABLE                    1
#define FM4_CAN_TREQR_AVAILABLE                   1
#define FM_CAN_TREQR_AVAILABLE                    1
/*******************************************************************************
* CANFD0
*******************************************************************************/
#define FM4_CANFD_BTP_AVAILABLE                   1
#define FM_CANFD_BTP_AVAILABLE                    1
#define FM4_CANFD_CCCR_AVAILABLE                  1
#define FM_CANFD_CCCR_AVAILABLE                   1
#define FM4_CANFD_CREL_AVAILABLE                  1
#define FM_CANFD_CREL_AVAILABLE                   1
#define FM4_CANFD_ECR_AVAILABLE                   1
#define FM_CANFD_ECR_AVAILABLE                    1
#define FM4_CANFD_ENDN_AVAILABLE                  1
#define FM_CANFD_ENDN_AVAILABLE                   1
#define FM4_CANFD_FBTP_AVAILABLE                  1
#define FM_CANFD_FBTP_AVAILABLE                   1
#define FM4_CANFD_FDDEAR_AVAILABLE                1
#define FM_CANFD_FDDEAR_AVAILABLE                 1
#define FM4_CANFD_FDECR_AVAILABLE                 1
#define FM_CANFD_FDECR_AVAILABLE                  1
#define FM4_CANFD_FDESCR_AVAILABLE                1
#define FM_CANFD_FDESCR_AVAILABLE                 1
#define FM4_CANFD_FDESR_AVAILABLE                 1
#define FM_CANFD_FDESR_AVAILABLE                  1
#define FM4_CANFD_FDSEAR_AVAILABLE                1
#define FM_CANFD_FDSEAR_AVAILABLE                 1
#define FM4_CANFD_GFC_AVAILABLE                   1
#define FM_CANFD_GFC_AVAILABLE                    1
#define FM4_CANFD_HPMS_AVAILABLE                  1
#define FM_CANFD_HPMS_AVAILABLE                   1
#define FM4_CANFD_IE_AVAILABLE                    1
#define FM_CANFD_IE_AVAILABLE                     1
#define FM4_CANFD_ILE_AVAILABLE                   1
#define FM_CANFD_ILE_AVAILABLE                    1
#define FM4_CANFD_ILS_AVAILABLE                   1
#define FM_CANFD_ILS_AVAILABLE                    1
#define FM4_CANFD_IR_AVAILABLE                    1
#define FM_CANFD_IR_AVAILABLE                     1
#define FM4_CANFD_NDAT1_AVAILABLE                 1
#define FM_CANFD_NDAT1_AVAILABLE                  1
#define FM4_CANFD_NDAT2_AVAILABLE                 1
#define FM_CANFD_NDAT2_AVAILABLE                  1
#define FM4_CANFD_PSR_AVAILABLE                   1
#define FM_CANFD_PSR_AVAILABLE                    1
#define FM4_CANFD_RWD_AVAILABLE                   1
#define FM_CANFD_RWD_AVAILABLE                    1
#define FM4_CANFD_RXBC_AVAILABLE                  1
#define FM_CANFD_RXBC_AVAILABLE                   1
#define FM4_CANFD_RXESC_AVAILABLE                 1
#define FM_CANFD_RXESC_AVAILABLE                  1
#define FM4_CANFD_RXF0A_AVAILABLE                 1
#define FM_CANFD_RXF0A_AVAILABLE                  1
#define FM4_CANFD_RXF0C_AVAILABLE                 1
#define FM_CANFD_RXF0C_AVAILABLE                  1
#define FM4_CANFD_RXF0S_AVAILABLE                 1
#define FM_CANFD_RXF0S_AVAILABLE                  1
#define FM4_CANFD_RXF1A_AVAILABLE                 1
#define FM_CANFD_RXF1A_AVAILABLE                  1
#define FM4_CANFD_RXF1C_AVAILABLE                 1
#define FM_CANFD_RXF1C_AVAILABLE                  1
#define FM4_CANFD_RXF1S_AVAILABLE                 1
#define FM_CANFD_RXF1S_AVAILABLE                  1
#define FM4_CANFD_SIDFC_AVAILABLE                 1
#define FM_CANFD_SIDFC_AVAILABLE                  1
#define FM4_CANFD_TEST_AVAILABLE                  1
#define FM_CANFD_TEST_AVAILABLE                   1
#define FM4_CANFD_TOCC_AVAILABLE                  1
#define FM_CANFD_TOCC_AVAILABLE                   1
#define FM4_CANFD_TOCV_AVAILABLE                  1
#define FM_CANFD_TOCV_AVAILABLE                   1
#define FM4_CANFD_TSCC_AVAILABLE                  1
#define FM_CANFD_TSCC_AVAILABLE                   1
#define FM4_CANFD_TSCDTR_AVAILABLE                1
#define FM_CANFD_TSCDTR_AVAILABLE                 1
#define FM4_CANFD_TSCNTR_AVAILABLE                1
#define FM_CANFD_TSCNTR_AVAILABLE                 1
#define FM4_CANFD_TSCPCLR_AVAILABLE               1
#define FM_CANFD_TSCPCLR_AVAILABLE                1
#define FM4_CANFD_TSCV_AVAILABLE                  1
#define FM_CANFD_TSCV_AVAILABLE                   1
#define FM4_CANFD_TSDIVR_AVAILABLE                1
#define FM_CANFD_TSDIVR_AVAILABLE                 1
#define FM4_CANFD_TSMDR_AVAILABLE                 1
#define FM_CANFD_TSMDR_AVAILABLE                  1
#define FM4_CANFD_TXBAR_AVAILABLE                 1
#define FM_CANFD_TXBAR_AVAILABLE                  1
#define FM4_CANFD_TXBC_AVAILABLE                  1
#define FM_CANFD_TXBC_AVAILABLE                   1
#define FM4_CANFD_TXBCF_AVAILABLE                 1
#define FM_CANFD_TXBCF_AVAILABLE                  1
#define FM4_CANFD_TXBCIE_AVAILABLE                1
#define FM_CANFD_TXBCIE_AVAILABLE                 1
#define FM4_CANFD_TXBCR_AVAILABLE                 1
#define FM_CANFD_TXBCR_AVAILABLE                  1
#define FM4_CANFD_TXBRP_AVAILABLE                 1
#define FM_CANFD_TXBRP_AVAILABLE                  1
#define FM4_CANFD_TXBTIE_AVAILABLE                1
#define FM_CANFD_TXBTIE_AVAILABLE                 1
#define FM4_CANFD_TXBTO_AVAILABLE                 1
#define FM_CANFD_TXBTO_AVAILABLE                  1
#define FM4_CANFD_TXEFC_AVAILABLE                 1
#define FM_CANFD_TXEFC_AVAILABLE                  1
#define FM4_CANFD_TXESC_AVAILABLE                 1
#define FM_CANFD_TXESC_AVAILABLE                  1
#define FM4_CANFD_TXFA_AVAILABLE                  1
#define FM_CANFD_TXFA_AVAILABLE                   1
#define FM4_CANFD_TXFQS_AVAILABLE                 1
#define FM_CANFD_TXFQS_AVAILABLE                  1
#define FM4_CANFD_TXFS_AVAILABLE                  1
#define FM_CANFD_TXFS_AVAILABLE                   1
#define FM4_CANFD_XIDAM_AVAILABLE                 1
#define FM_CANFD_XIDAM_AVAILABLE                  1
#define FM4_CANFD_XIDFC_AVAILABLE                 1
#define FM_CANFD_XIDFC_AVAILABLE                  1
/*******************************************************************************
* CANPRES
*******************************************************************************/
#define FM4_CANPRES_CANPRE_AVAILABLE              1
#define FM_CANPRES_CANPRE_AVAILABLE               1
/*******************************************************************************
* CLK_GATING
*******************************************************************************/
#define FM4_CLK_GATING_CKEN0_AVAILABLE            1
#define FM_CLK_GATING_CKEN0_AVAILABLE             1
#define FM4_CLK_GATING_CKEN1_AVAILABLE            1
#define FM_CLK_GATING_CKEN1_AVAILABLE             1
#define FM4_CLK_GATING_CKEN2_AVAILABLE            1
#define FM_CLK_GATING_CKEN2_AVAILABLE             1
#define FM4_CLK_GATING_MRST0_AVAILABLE            1
#define FM_CLK_GATING_MRST0_AVAILABLE             1
#define FM4_CLK_GATING_MRST1_AVAILABLE            1
#define FM_CLK_GATING_MRST1_AVAILABLE             1
#define FM4_CLK_GATING_MRST2_AVAILABLE            1
#define FM_CLK_GATING_MRST2_AVAILABLE             1
/*******************************************************************************
* CRC
*******************************************************************************/
#define FM4_CRC_CRCCR_AVAILABLE                   1
#define FM_CRC_CRCCR_AVAILABLE                    1
#define FM4_CRC_CRCIN_AVAILABLE                   1
#define FM_CRC_CRCIN_AVAILABLE                    1
#define FM4_CRC_CRCINIT_AVAILABLE                 1
#define FM_CRC_CRCINIT_AVAILABLE                  1
#define FM4_CRC_CRCR_AVAILABLE                    1
#define FM_CRC_CRCR_AVAILABLE                     1
/*******************************************************************************
* CRG
*******************************************************************************/
#define FM4_CRG_APBC0_PSR_AVAILABLE               1
#define FM_CRG_APBC0_PSR_AVAILABLE                1
#define FM4_CRG_APBC1_PSR_AVAILABLE               1
#define FM_CRG_APBC1_PSR_AVAILABLE                1
#define FM4_CRG_APBC2_PSR_AVAILABLE               1
#define FM_CRG_APBC2_PSR_AVAILABLE                1
#define FM4_CRG_BSC_PSR_AVAILABLE                 1
#define FM_CRG_BSC_PSR_AVAILABLE                  1
#define FM4_CRG_CSV_CTL_AVAILABLE                 1
#define FM_CRG_CSV_CTL_AVAILABLE                  1
#define FM4_CRG_CSV_STR_AVAILABLE                 1
#define FM_CRG_CSV_STR_AVAILABLE                  1
#define FM4_CRG_CSW_TMR_AVAILABLE                 1
#define FM_CRG_CSW_TMR_AVAILABLE                  1
#define FM4_CRG_DBWDT_CTL_AVAILABLE               1
#define FM_CRG_DBWDT_CTL_AVAILABLE                1
#define FM4_CRG_FCSWD_CTL_AVAILABLE               1
#define FM_CRG_FCSWD_CTL_AVAILABLE                1
#define FM4_CRG_FCSWH_CTL_AVAILABLE               1
#define FM_CRG_FCSWH_CTL_AVAILABLE                1
#define FM4_CRG_FCSWL_CTL_AVAILABLE               1
#define FM_CRG_FCSWL_CTL_AVAILABLE                1
#define FM4_CRG_INT_CLR_AVAILABLE                 1
#define FM_CRG_INT_CLR_AVAILABLE                  1
#define FM4_CRG_INT_ENR_AVAILABLE                 1
#define FM_CRG_INT_ENR_AVAILABLE                  1
#define FM4_CRG_INT_STR_AVAILABLE                 1
#define FM_CRG_INT_STR_AVAILABLE                  1
#define FM4_CRG_PLL_CTL1_AVAILABLE                1
#define FM_CRG_PLL_CTL1_AVAILABLE                 1
#define FM4_CRG_PLL_CTL2_AVAILABLE                1
#define FM_CRG_PLL_CTL2_AVAILABLE                 1
#define FM4_CRG_PLLCG_CTL_AVAILABLE               1
#define FM_CRG_PLLCG_CTL_AVAILABLE                1
#define FM4_CRG_PSW_TMR_AVAILABLE                 1
#define FM_CRG_PSW_TMR_AVAILABLE                  1
#define FM4_CRG_RST_STR_AVAILABLE                 1
#define FM_CRG_RST_STR_AVAILABLE                  1
#define FM4_CRG_SCM_CTL_AVAILABLE                 1
#define FM_CRG_SCM_CTL_AVAILABLE                  1
#define FM4_CRG_SCM_STR_AVAILABLE                 1
#define FM_CRG_SCM_STR_AVAILABLE                  1
#define FM4_CRG_STB_CTL_AVAILABLE                 1
#define FM_CRG_STB_CTL_AVAILABLE                  1
#define FM4_CRG_SWC_PSR_AVAILABLE                 1
#define FM_CRG_SWC_PSR_AVAILABLE                  1
#define FM4_CRG_TTC_PSR_AVAILABLE                 1
#define FM_CRG_TTC_PSR_AVAILABLE                  1
/*******************************************************************************
* CRTRIM
*******************************************************************************/
#define FM4_CRTRIM_MCR_FTRM_AVAILABLE             1
