mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
#define bFM_BT7_RT_TMCR_STRG                      *((volatile  uint8_t *)(0x424A5980UL))
#define bFM4_BT7_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424A5980UL))
#define bFM_BT7_RT_TMCR_CTEN                      *((volatile  uint8_t *)(0x424A5984UL))
#define bFM4_BT7_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A5984UL))
#define bFM_BT7_RT_TMCR_MDSE                      *((volatile  uint8_t *)(0x424A5988UL))
#define bFM4_BT7_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A5988UL))
#define bFM_BT7_RT_TMCR_OSEL                      *((volatile  uint8_t *)(0x424A598CUL))
#define bFM4_BT7_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A598CUL))
#define bFM_BT7_RT_TMCR_T32                       *((volatile  uint8_t *)(0x424A599CUL))
#define bFM4_BT7_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424A599CUL))

#define bFM_BT7_RT_TMCR2_CKS3                     *((volatile  uint8_t *)(0x424A5A20UL))
#define bFM4_BT7_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A5A20UL))
#define bFM_BT7_RT_TMCR2_GATE                     *((volatile  uint8_t *)(0x424A5A3CUL))
#define bFM4_BT7_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424A5A3CUL))


/*******************************************************************************
* BT Registers BT8
*   Bitband Section
*******************************************************************************/
#define bFM_BT8_PPG_STC_UDIR                      *((volatile  uint8_t *)(0x424A8200UL))
#define bFM4_BT8_PPG_STC_UDIR                     *((volatile  uint8_t *)(0x424A8200UL))
#define bFM_BT8_PPG_STC_TGIR                      *((volatile  uint8_t *)(0x424A8208UL))
#define bFM4_BT8_PPG_STC_TGIR                     *((volatile  uint8_t *)(0x424A8208UL))
#define bFM_BT8_PPG_STC_UDIE                      *((volatile  uint8_t *)(0x424A8210UL))
#define bFM4_BT8_PPG_STC_UDIE                     *((volatile  uint8_t *)(0x424A8210UL))
#define bFM_BT8_PPG_STC_TGIE                      *((volatile  uint8_t *)(0x424A8218UL))
#define bFM4_BT8_PPG_STC_TGIE                     *((volatile  uint8_t *)(0x424A8218UL))

#define bFM_BT8_PPG_TMCR_STRG                     *((volatile  uint8_t *)(0x424A8180UL))
#define bFM4_BT8_PPG_TMCR_STRG                    *((volatile  uint8_t *)(0x424A8180UL))
#define bFM_BT8_PPG_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8184UL))
#define bFM4_BT8_PPG_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A8184UL))
#define bFM_BT8_PPG_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8188UL))
#define bFM4_BT8_PPG_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A8188UL))
#define bFM_BT8_PPG_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A818CUL))
#define bFM4_BT8_PPG_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A818CUL))
#define bFM_BT8_PPG_TMCR_PMSK                     *((volatile  uint8_t *)(0x424A81A8UL))
#define bFM4_BT8_PPG_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A81A8UL))
#define bFM_BT8_PPG_TMCR_RTGEN                    *((volatile  uint8_t *)(0x424A81ACUL))
#define bFM4_BT8_PPG_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A81ACUL))

#define bFM_BT8_PPG_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8220UL))
#define bFM4_BT8_PPG_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A8220UL))

#define bFM_BT8_PWC_STC_OVIR                      *((volatile  uint8_t *)(0x424A8200UL))
#define bFM4_BT8_PWC_STC_OVIR                     *((volatile  uint8_t *)(0x424A8200UL))
#define bFM_BT8_PWC_STC_EDIR                      *((volatile  uint8_t *)(0x424A8208UL))
#define bFM4_BT8_PWC_STC_EDIR                     *((volatile  uint8_t *)(0x424A8208UL))
#define bFM_BT8_PWC_STC_OVIE                      *((volatile  uint8_t *)(0x424A8210UL))
#define bFM4_BT8_PWC_STC_OVIE                     *((volatile  uint8_t *)(0x424A8210UL))
#define bFM_BT8_PWC_STC_EDIE                      *((volatile  uint8_t *)(0x424A8218UL))
#define bFM4_BT8_PWC_STC_EDIE                     *((volatile  uint8_t *)(0x424A8218UL))
#define bFM_BT8_PWC_STC_ERR                       *((volatile  uint8_t *)(0x424A821CUL))
#define bFM4_BT8_PWC_STC_ERR                      *((volatile  uint8_t *)(0x424A821CUL))

#define bFM_BT8_PWC_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8184UL))
#define bFM4_BT8_PWC_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A8184UL))
#define bFM_BT8_PWC_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8188UL))
#define bFM4_BT8_PWC_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A8188UL))
#define bFM_BT8_PWC_TMCR_T32                      *((volatile  uint8_t *)(0x424A819CUL))
#define bFM4_BT8_PWC_TMCR_T32                     *((volatile  uint8_t *)(0x424A819CUL))

#define bFM_BT8_PWC_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8220UL))
#define bFM4_BT8_PWC_TMCR2_CKS3                   *((volatile  uint8_t *)(0x424A8220UL))

#define bFM_BT8_PWM_STC_UDIR                      *((volatile  uint8_t *)(0x424A8200UL))
#define bFM4_BT8_PWM_STC_UDIR                     *((volatile  uint8_t *)(0x424A8200UL))
#define bFM_BT8_PWM_STC_DTIR                      *((volatile  uint8_t *)(0x424A8204UL))
#define bFM4_BT8_PWM_STC_DTIR                     *((volatile  uint8_t *)(0x424A8204UL))
#define bFM_BT8_PWM_STC_TGIR                      *((volatile  uint8_t *)(0x424A8208UL))
#define bFM4_BT8_PWM_STC_TGIR                     *((volatile  uint8_t *)(0x424A8208UL))
#define bFM_BT8_PWM_STC_UDIE                      *((volatile  uint8_t *)(0x424A8210UL))
#define bFM4_BT8_PWM_STC_UDIE                     *((volatile  uint8_t *)(0x424A8210UL))
#define bFM_BT8_PWM_STC_DTIE                      *((volatile  uint8_t *)(0x424A8214UL))
#define bFM4_BT8_PWM_STC_DTIE                     *((volatile  uint8_t *)(0x424A8214UL))
#define bFM_BT8_PWM_STC_TGIE                      *((volatile  uint8_t *)(0x424A8218UL))
#define bFM4_BT8_PWM_STC_TGIE                     *((volatile  uint8_t *)(0x424A8218UL))

#define bFM_BT8_PWM_TMCR_STRG                     *((volatile  uint8_t *)(0x424A8180UL))
#define bFM4_BT8_PWM_TMCR_STRG                    *((volatile  uint8_t *)(0x424A8180UL))
#define bFM_BT8_PWM_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8184UL))
#define bFM4_BT8_PWM_TMCR_CTEN                    *((volatile  uint8_t *)(0x424A8184UL))
#define bFM_BT8_PWM_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8188UL))
#define bFM4_BT8_PWM_TMCR_MDSE                    *((volatile  uint8_t *)(0x424A8188UL))
#define bFM_BT8_PWM_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A818CUL))
#define bFM4_BT8_PWM_TMCR_OSEL                    *((volatile  uint8_t *)(0x424A818CUL))
#define bFM_BT8_PWM_TMCR_PMSK                     *((volatile  uint8_t *)(0x424A81A8UL))
#define bFM4_BT8_PWM_TMCR_PMSK                    *((volatile  uint8_t *)(0x424A81A8UL))
#define bFM_BT8_PWM_TMCR_RTGEN                    *((volatile  uint8_t *)(0x424A81ACUL))
#define bFM4_BT8_PWM_TMCR_RTGEN                   *((volatile  uint8_t *)(0x424A81ACUL))

