mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
#define bFM_BT9_RT_TMCR_STRG                      *((volatile  uint8_t *)(0x424A8980UL))
#define bFM4_BT9_RT_TMCR_STRG                     *((volatile  uint8_t *)(0x424A8980UL))
#define bFM_BT9_RT_TMCR_CTEN                      *((volatile  uint8_t *)(0x424A8984UL))
#define bFM4_BT9_RT_TMCR_CTEN                     *((volatile  uint8_t *)(0x424A8984UL))
#define bFM_BT9_RT_TMCR_MDSE                      *((volatile  uint8_t *)(0x424A8988UL))
#define bFM4_BT9_RT_TMCR_MDSE                     *((volatile  uint8_t *)(0x424A8988UL))
#define bFM_BT9_RT_TMCR_OSEL                      *((volatile  uint8_t *)(0x424A898CUL))
#define bFM4_BT9_RT_TMCR_OSEL                     *((volatile  uint8_t *)(0x424A898CUL))
#define bFM_BT9_RT_TMCR_T32                       *((volatile  uint8_t *)(0x424A899CUL))
#define bFM4_BT9_RT_TMCR_T32                      *((volatile  uint8_t *)(0x424A899CUL))

#define bFM_BT9_RT_TMCR2_CKS3                     *((volatile  uint8_t *)(0x424A8A20UL))
#define bFM4_BT9_RT_TMCR2_CKS3                    *((volatile  uint8_t *)(0x424A8A20UL))
#define bFM_BT9_RT_TMCR2_GATE                     *((volatile  uint8_t *)(0x424A8A3CUL))
#define bFM4_BT9_RT_TMCR2_GATE                    *((volatile  uint8_t *)(0x424A8A3CUL))


/*******************************************************************************
* BTIOSEL03 Registers BTIOSEL03
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* BTIOSEL47 Registers BTIOSEL47
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* BTIOSEL8B Registers BTIOSEL8B
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* BTIOSELCF Registers BTIOSELCF
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* CAN Registers CAN0
*   Bitband Section
*******************************************************************************/
#define bFM_CAN0_CTRLR_INIT                       *((volatile  uint8_t *)(0x42C40000UL))
#define bFM4_CAN0_CTRLR_INIT                      *((volatile  uint8_t *)(0x42C40000UL))
#define bFM_CAN0_CTRLR_IE                         *((volatile  uint8_t *)(0x42C40004UL))
#define bFM4_CAN0_CTRLR_IE                        *((volatile  uint8_t *)(0x42C40004UL))
#define bFM_CAN0_CTRLR_SIE                        *((volatile  uint8_t *)(0x42C40008UL))
#define bFM4_CAN0_CTRLR_SIE                       *((volatile  uint8_t *)(0x42C40008UL))
#define bFM_CAN0_CTRLR_EIE                        *((volatile  uint8_t *)(0x42C4000CUL))
#define bFM4_CAN0_CTRLR_EIE                       *((volatile  uint8_t *)(0x42C4000CUL))
#define bFM_CAN0_CTRLR_DAR                        *((volatile  uint8_t *)(0x42C40014UL))
#define bFM4_CAN0_CTRLR_DAR                       *((volatile  uint8_t *)(0x42C40014UL))
#define bFM_CAN0_CTRLR_CCE                        *((volatile  uint8_t *)(0x42C40018UL))
#define bFM4_CAN0_CTRLR_CCE                       *((volatile  uint8_t *)(0x42C40018UL))
#define bFM_CAN0_CTRLR_TEST                       *((volatile  uint8_t *)(0x42C4001CUL))
#define bFM4_CAN0_CTRLR_TEST                      *((volatile  uint8_t *)(0x42C4001CUL))

#define bFM_CAN0_ERRCNT_RP                        *((volatile  uint8_t *)(0x42C400BCUL))
#define bFM4_CAN0_ERRCNT_RP                       *((volatile  uint8_t *)(0x42C400BCUL))

#define bFM_CAN0_IF1ARB_DIR                       *((volatile  uint8_t *)(0x42C40374UL))
#define bFM4_CAN0_IF1ARB_DIR                      *((volatile  uint8_t *)(0x42C40374UL))
#define bFM_CAN0_IF1ARB_XTD                       *((volatile  uint8_t *)(0x42C40378UL))
#define bFM4_CAN0_IF1ARB_XTD                      *((volatile  uint8_t *)(0x42C40378UL))
#define bFM_CAN0_IF1ARB_MSGVAL                    *((volatile  uint8_t *)(0x42C4037CUL))
#define bFM4_CAN0_IF1ARB_MSGVAL                   *((volatile  uint8_t *)(0x42C4037CUL))

#define bFM_CAN0_IF1CMSK_DATAB                    *((volatile  uint8_t *)(0x42C40240UL))
#define bFM4_CAN0_IF1CMSK_DATAB                   *((volatile  uint8_t *)(0x42C40240UL))
#define bFM_CAN0_IF1CMSK_DATAA                    *((volatile  uint8_t *)(0x42C40244UL))
#define bFM4_CAN0_IF1CMSK_DATAA                   *((volatile  uint8_t *)(0x42C40244UL))
#define bFM_CAN0_IF1CMSK_NEWDAT                   *((volatile  uint8_t *)(0x42C40248UL))
#define bFM4_CAN0_IF1CMSK_NEWDAT                  *((volatile  uint8_t *)(0x42C40248UL))
#define bFM_CAN0_IF1CMSK_CIP                      *((volatile  uint8_t *)(0x42C4024CUL))
#define bFM4_CAN0_IF1CMSK_CIP                     *((volatile  uint8_t *)(0x42C4024CUL))
#define bFM_CAN0_IF1CMSK_CONTROL                  *((volatile  uint8_t *)(0x42C40250UL))
#define bFM4_CAN0_IF1CMSK_CONTROL                 *((volatile  uint8_t *)(0x42C40250UL))
#define bFM_CAN0_IF1CMSK_ARB                      *((volatile  uint8_t *)(0x42C40254UL))
#define bFM4_CAN0_IF1CMSK_ARB                     *((volatile  uint8_t *)(0x42C40254UL))
#define bFM_CAN0_IF1CMSK_MASK                     *((volatile  uint8_t *)(0x42C40258UL))
#define bFM4_CAN0_IF1CMSK_MASK                    *((volatile  uint8_t *)(0x42C40258UL))
#define bFM_CAN0_IF1CMSK_WR_RD                    *((volatile  uint8_t *)(0x42C4025CUL))
#define bFM4_CAN0_IF1CMSK_WR_RD                   *((volatile  uint8_t *)(0x42C4025CUL))

#define bFM_CAN0_IF1CREQ_BUSY                     *((volatile  uint8_t *)(0x42C4023CUL))
#define bFM4_CAN0_IF1CREQ_BUSY                    *((volatile  uint8_t *)(0x42C4023CUL))

#define bFM_CAN0_IF1MCTR_EOB                      *((volatile  uint8_t *)(0x42C4039CUL))
#define bFM4_CAN0_IF1MCTR_EOB                     *((volatile  uint8_t *)(0x42C4039CUL))
#define bFM_CAN0_IF1MCTR_TXRQST                   *((volatile  uint8_t *)(0x42C403A0UL))
#define bFM4_CAN0_IF1MCTR_TXRQST                  *((volatile  uint8_t *)(0x42C403A0UL))
#define bFM_CAN0_IF1MCTR_RMTEN                    *((volatile  uint8_t *)(0x42C403A4UL))
#define bFM4_CAN0_IF1MCTR_RMTEN                   *((volatile  uint8_t *)(0x42C403A4UL))
#define bFM_CAN0_IF1MCTR_RXIE                     *((volatile  uint8_t *)(0x42C403A8UL))
#define bFM4_CAN0_IF1MCTR_RXIE                    *((volatile  uint8_t *)(0x42C403A8UL))
#define bFM_CAN0_IF1MCTR_TXIE                     *((volatile  uint8_t *)(0x42C403ACUL))
#define bFM4_CAN0_IF1MCTR_TXIE                    *((volatile  uint8_t *)(0x42C403ACUL))
#define bFM_CAN0_IF1MCTR_UMASK                    *((volatile  uint8_t *)(0x42C403B0UL))
#define bFM4_CAN0_IF1MCTR_UMASK                   *((volatile  uint8_t *)(0x42C403B0UL))
#define bFM_CAN0_IF1MCTR_INTPND                   *((volatile  uint8_t *)(0x42C403B4UL))
#define bFM4_CAN0_IF1MCTR_INTPND                  *((volatile  uint8_t *)(0x42C403B4UL))
#define bFM_CAN0_IF1MCTR_MSGLST                   *((volatile  uint8_t *)(0x42C403B8UL))
#define bFM4_CAN0_IF1MCTR_MSGLST                  *((volatile  uint8_t *)(0x42C403B8UL))
#define bFM_CAN0_IF1MCTR_NEWDAT                   *((volatile  uint8_t *)(0x42C403BCUL))
#define bFM4_CAN0_IF1MCTR_NEWDAT                  *((volatile  uint8_t *)(0x42C403BCUL))

#define bFM_CAN0_IF1MSK_MDIR                      *((volatile  uint8_t *)(0x42C402F8UL))
#define bFM4_CAN0_IF1MSK_MDIR                     *((volatile  uint8_t *)(0x42C402F8UL))
#define bFM_CAN0_IF1MSK_MXTD                      *((volatile  uint8_t *)(0x42C402FCUL))
#define bFM4_CAN0_IF1MSK_MXTD                     *((volatile  uint8_t *)(0x42C402FCUL))

#define bFM_CAN0_IF2ARB_DIR                       *((volatile  uint8_t *)(0x42C40974UL))
#define bFM4_CAN0_IF2ARB_DIR                      *((volatile  uint8_t *)(0x42C40974UL))
#define bFM_CAN0_IF2ARB_XTD                       *((volatile  uint8_t *)(0x42C40978UL))
#define bFM4_CAN0_IF2ARB_XTD                      *((volatile  uint8_t *)(0x42C40978UL))
#define bFM_CAN0_IF2ARB_MSGVAL                    *((volatile  uint8_t *)(0x42C4097CUL))
#define bFM4_CAN0_IF2ARB_MSGVAL                   *((volatile  uint8_t *)(0x42C4097CUL))

