mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
#define bFM_CANFD0_NDAT2_ND32                     *((volatile  uint8_t *)(0x42E01380UL))
#define bFM4_CANFD0_NDAT2_ND32                    *((volatile  uint8_t *)(0x42E01380UL))
#define bFM_CANFD0_NDAT2_ND33                     *((volatile  uint8_t *)(0x42E01384UL))
#define bFM4_CANFD0_NDAT2_ND33                    *((volatile  uint8_t *)(0x42E01384UL))
#define bFM_CANFD0_NDAT2_ND34                     *((volatile  uint8_t *)(0x42E01388UL))
#define bFM4_CANFD0_NDAT2_ND34                    *((volatile  uint8_t *)(0x42E01388UL))
#define bFM_CANFD0_NDAT2_ND35                     *((volatile  uint8_t *)(0x42E0138CUL))
#define bFM4_CANFD0_NDAT2_ND35                    *((volatile  uint8_t *)(0x42E0138CUL))
#define bFM_CANFD0_NDAT2_ND36                     *((volatile  uint8_t *)(0x42E01390UL))
#define bFM4_CANFD0_NDAT2_ND36                    *((volatile  uint8_t *)(0x42E01390UL))
#define bFM_CANFD0_NDAT2_ND37                     *((volatile  uint8_t *)(0x42E01394UL))
#define bFM4_CANFD0_NDAT2_ND37                    *((volatile  uint8_t *)(0x42E01394UL))
#define bFM_CANFD0_NDAT2_ND38                     *((volatile  uint8_t *)(0x42E01398UL))
#define bFM4_CANFD0_NDAT2_ND38                    *((volatile  uint8_t *)(0x42E01398UL))
#define bFM_CANFD0_NDAT2_ND39                     *((volatile  uint8_t *)(0x42E0139CUL))
#define bFM4_CANFD0_NDAT2_ND39                    *((volatile  uint8_t *)(0x42E0139CUL))
#define bFM_CANFD0_NDAT2_ND40                     *((volatile  uint8_t *)(0x42E013A0UL))
#define bFM4_CANFD0_NDAT2_ND40                    *((volatile  uint8_t *)(0x42E013A0UL))
#define bFM_CANFD0_NDAT2_ND41                     *((volatile  uint8_t *)(0x42E013A4UL))
#define bFM4_CANFD0_NDAT2_ND41                    *((volatile  uint8_t *)(0x42E013A4UL))
#define bFM_CANFD0_NDAT2_ND42                     *((volatile  uint8_t *)(0x42E013A8UL))
#define bFM4_CANFD0_NDAT2_ND42                    *((volatile  uint8_t *)(0x42E013A8UL))
#define bFM_CANFD0_NDAT2_ND43                     *((volatile  uint8_t *)(0x42E013ACUL))
#define bFM4_CANFD0_NDAT2_ND43                    *((volatile  uint8_t *)(0x42E013ACUL))
#define bFM_CANFD0_NDAT2_ND44                     *((volatile  uint8_t *)(0x42E013B0UL))
#define bFM4_CANFD0_NDAT2_ND44                    *((volatile  uint8_t *)(0x42E013B0UL))
#define bFM_CANFD0_NDAT2_ND45                     *((volatile  uint8_t *)(0x42E013B4UL))
#define bFM4_CANFD0_NDAT2_ND45                    *((volatile  uint8_t *)(0x42E013B4UL))
#define bFM_CANFD0_NDAT2_ND46                     *((volatile  uint8_t *)(0x42E013B8UL))
#define bFM4_CANFD0_NDAT2_ND46                    *((volatile  uint8_t *)(0x42E013B8UL))
#define bFM_CANFD0_NDAT2_ND47                     *((volatile  uint8_t *)(0x42E013BCUL))
#define bFM4_CANFD0_NDAT2_ND47                    *((volatile  uint8_t *)(0x42E013BCUL))
#define bFM_CANFD0_NDAT2_ND48                     *((volatile  uint8_t *)(0x42E013C0UL))
#define bFM4_CANFD0_NDAT2_ND48                    *((volatile  uint8_t *)(0x42E013C0UL))
#define bFM_CANFD0_NDAT2_ND49                     *((volatile  uint8_t *)(0x42E013C4UL))
#define bFM4_CANFD0_NDAT2_ND49                    *((volatile  uint8_t *)(0x42E013C4UL))
#define bFM_CANFD0_NDAT2_ND50                     *((volatile  uint8_t *)(0x42E013C8UL))
#define bFM4_CANFD0_NDAT2_ND50                    *((volatile  uint8_t *)(0x42E013C8UL))
#define bFM_CANFD0_NDAT2_ND51                     *((volatile  uint8_t *)(0x42E013CCUL))
#define bFM4_CANFD0_NDAT2_ND51                    *((volatile  uint8_t *)(0x42E013CCUL))
#define bFM_CANFD0_NDAT2_ND52                     *((volatile  uint8_t *)(0x42E013D0UL))
#define bFM4_CANFD0_NDAT2_ND52                    *((volatile  uint8_t *)(0x42E013D0UL))
#define bFM_CANFD0_NDAT2_ND53                     *((volatile  uint8_t *)(0x42E013D4UL))
#define bFM4_CANFD0_NDAT2_ND53                    *((volatile  uint8_t *)(0x42E013D4UL))
#define bFM_CANFD0_NDAT2_ND54                     *((volatile  uint8_t *)(0x42E013D8UL))
#define bFM4_CANFD0_NDAT2_ND54                    *((volatile  uint8_t *)(0x42E013D8UL))
#define bFM_CANFD0_NDAT2_ND55                     *((volatile  uint8_t *)(0x42E013DCUL))
#define bFM4_CANFD0_NDAT2_ND55                    *((volatile  uint8_t *)(0x42E013DCUL))
#define bFM_CANFD0_NDAT2_ND56                     *((volatile  uint8_t *)(0x42E013E0UL))
#define bFM4_CANFD0_NDAT2_ND56                    *((volatile  uint8_t *)(0x42E013E0UL))
#define bFM_CANFD0_NDAT2_ND57                     *((volatile  uint8_t *)(0x42E013E4UL))
#define bFM4_CANFD0_NDAT2_ND57                    *((volatile  uint8_t *)(0x42E013E4UL))
#define bFM_CANFD0_NDAT2_ND58                     *((volatile  uint8_t *)(0x42E013E8UL))
#define bFM4_CANFD0_NDAT2_ND58                    *((volatile  uint8_t *)(0x42E013E8UL))
#define bFM_CANFD0_NDAT2_ND59                     *((volatile  uint8_t *)(0x42E013ECUL))
#define bFM4_CANFD0_NDAT2_ND59                    *((volatile  uint8_t *)(0x42E013ECUL))
#define bFM_CANFD0_NDAT2_ND60                     *((volatile  uint8_t *)(0x42E013F0UL))
#define bFM4_CANFD0_NDAT2_ND60                    *((volatile  uint8_t *)(0x42E013F0UL))
#define bFM_CANFD0_NDAT2_ND61                     *((volatile  uint8_t *)(0x42E013F4UL))
#define bFM4_CANFD0_NDAT2_ND61                    *((volatile  uint8_t *)(0x42E013F4UL))
#define bFM_CANFD0_NDAT2_ND62                     *((volatile  uint8_t *)(0x42E013F8UL))
#define bFM4_CANFD0_NDAT2_ND62                    *((volatile  uint8_t *)(0x42E013F8UL))
#define bFM_CANFD0_NDAT2_ND63                     *((volatile  uint8_t *)(0x42E013FCUL))
#define bFM4_CANFD0_NDAT2_ND63                    *((volatile  uint8_t *)(0x42E013FCUL))

#define bFM_CANFD0_PSR_EP                         *((volatile  uint8_t *)(0x42E00894UL))
#define bFM4_CANFD0_PSR_EP                        *((volatile  uint8_t *)(0x42E00894UL))
#define bFM_CANFD0_PSR_EW                         *((volatile  uint8_t *)(0x42E00898UL))
#define bFM4_CANFD0_PSR_EW                        *((volatile  uint8_t *)(0x42E00898UL))
#define bFM_CANFD0_PSR_BO                         *((volatile  uint8_t *)(0x42E0089CUL))
#define bFM4_CANFD0_PSR_BO                        *((volatile  uint8_t *)(0x42E0089CUL))
#define bFM_CANFD0_PSR_RESI                       *((volatile  uint8_t *)(0x42E008ACUL))
#define bFM4_CANFD0_PSR_RESI                      *((volatile  uint8_t *)(0x42E008ACUL))
#define bFM_CANFD0_PSR_RBRS                       *((volatile  uint8_t *)(0x42E008B0UL))
#define bFM4_CANFD0_PSR_RBRS                      *((volatile  uint8_t *)(0x42E008B0UL))
#define bFM_CANFD0_PSR_REDL                       *((volatile  uint8_t *)(0x42E008B4UL))
#define bFM4_CANFD0_PSR_REDL                      *((volatile  uint8_t *)(0x42E008B4UL))

#define bFM_CANFD0_RXF0C_F0OM                     *((volatile  uint8_t *)(0x42E0147CUL))
#define bFM4_CANFD0_RXF0C_F0OM                    *((volatile  uint8_t *)(0x42E0147CUL))

#define bFM_CANFD0_RXF0S_F0F                      *((volatile  uint8_t *)(0x42E014E0UL))
#define bFM4_CANFD0_RXF0S_F0F                     *((volatile  uint8_t *)(0x42E014E0UL))
#define bFM_CANFD0_RXF0S_RF0L                     *((volatile  uint8_t *)(0x42E014E4UL))
#define bFM4_CANFD0_RXF0S_RF0L                    *((volatile  uint8_t *)(0x42E014E4UL))

#define bFM_CANFD0_RXF1C_F1OM                     *((volatile  uint8_t *)(0x42E0167CUL))
#define bFM4_CANFD0_RXF1C_F1OM                    *((volatile  uint8_t *)(0x42E0167CUL))

