mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
#define bFM_CANFD0_TXBTIE_TIE0                    *((volatile  uint8_t *)(0x42E01C00UL))
#define bFM4_CANFD0_TXBTIE_TIE0                   *((volatile  uint8_t *)(0x42E01C00UL))
#define bFM_CANFD0_TXBTIE_TIE1                    *((volatile  uint8_t *)(0x42E01C04UL))
#define bFM4_CANFD0_TXBTIE_TIE1                   *((volatile  uint8_t *)(0x42E01C04UL))
#define bFM_CANFD0_TXBTIE_TIE2                    *((volatile  uint8_t *)(0x42E01C08UL))
#define bFM4_CANFD0_TXBTIE_TIE2                   *((volatile  uint8_t *)(0x42E01C08UL))
#define bFM_CANFD0_TXBTIE_TIE3                    *((volatile  uint8_t *)(0x42E01C0CUL))
#define bFM4_CANFD0_TXBTIE_TIE3                   *((volatile  uint8_t *)(0x42E01C0CUL))
#define bFM_CANFD0_TXBTIE_TIE4                    *((volatile  uint8_t *)(0x42E01C10UL))
#define bFM4_CANFD0_TXBTIE_TIE4                   *((volatile  uint8_t *)(0x42E01C10UL))
#define bFM_CANFD0_TXBTIE_TIE5                    *((volatile  uint8_t *)(0x42E01C14UL))
#define bFM4_CANFD0_TXBTIE_TIE5                   *((volatile  uint8_t *)(0x42E01C14UL))
#define bFM_CANFD0_TXBTIE_TIE6                    *((volatile  uint8_t *)(0x42E01C18UL))
#define bFM4_CANFD0_TXBTIE_TIE6                   *((volatile  uint8_t *)(0x42E01C18UL))
#define bFM_CANFD0_TXBTIE_TIE7                    *((volatile  uint8_t *)(0x42E01C1CUL))
#define bFM4_CANFD0_TXBTIE_TIE7                   *((volatile  uint8_t *)(0x42E01C1CUL))
#define bFM_CANFD0_TXBTIE_TIE8                    *((volatile  uint8_t *)(0x42E01C20UL))
#define bFM4_CANFD0_TXBTIE_TIE8                   *((volatile  uint8_t *)(0x42E01C20UL))
#define bFM_CANFD0_TXBTIE_TIE9                    *((volatile  uint8_t *)(0x42E01C24UL))
#define bFM4_CANFD0_TXBTIE_TIE9                   *((volatile  uint8_t *)(0x42E01C24UL))
#define bFM_CANFD0_TXBTIE_TIE10                   *((volatile  uint8_t *)(0x42E01C28UL))
#define bFM4_CANFD0_TXBTIE_TIE10                  *((volatile  uint8_t *)(0x42E01C28UL))
#define bFM_CANFD0_TXBTIE_TIE11                   *((volatile  uint8_t *)(0x42E01C2CUL))
#define bFM4_CANFD0_TXBTIE_TIE11                  *((volatile  uint8_t *)(0x42E01C2CUL))
#define bFM_CANFD0_TXBTIE_TIE12                   *((volatile  uint8_t *)(0x42E01C30UL))
#define bFM4_CANFD0_TXBTIE_TIE12                  *((volatile  uint8_t *)(0x42E01C30UL))
#define bFM_CANFD0_TXBTIE_TIE13                   *((volatile  uint8_t *)(0x42E01C34UL))
#define bFM4_CANFD0_TXBTIE_TIE13                  *((volatile  uint8_t *)(0x42E01C34UL))
#define bFM_CANFD0_TXBTIE_TIE14                   *((volatile  uint8_t *)(0x42E01C38UL))
#define bFM4_CANFD0_TXBTIE_TIE14                  *((volatile  uint8_t *)(0x42E01C38UL))
#define bFM_CANFD0_TXBTIE_TIE15                   *((volatile  uint8_t *)(0x42E01C3CUL))
#define bFM4_CANFD0_TXBTIE_TIE15                  *((volatile  uint8_t *)(0x42E01C3CUL))
#define bFM_CANFD0_TXBTIE_TIE16                   *((volatile  uint8_t *)(0x42E01C40UL))
#define bFM4_CANFD0_TXBTIE_TIE16                  *((volatile  uint8_t *)(0x42E01C40UL))
#define bFM_CANFD0_TXBTIE_TIE17                   *((volatile  uint8_t *)(0x42E01C44UL))
#define bFM4_CANFD0_TXBTIE_TIE17                  *((volatile  uint8_t *)(0x42E01C44UL))
#define bFM_CANFD0_TXBTIE_TIE18                   *((volatile  uint8_t *)(0x42E01C48UL))
#define bFM4_CANFD0_TXBTIE_TIE18                  *((volatile  uint8_t *)(0x42E01C48UL))
#define bFM_CANFD0_TXBTIE_TIE19                   *((volatile  uint8_t *)(0x42E01C4CUL))
#define bFM4_CANFD0_TXBTIE_TIE19                  *((volatile  uint8_t *)(0x42E01C4CUL))
#define bFM_CANFD0_TXBTIE_TIE20                   *((volatile  uint8_t *)(0x42E01C50UL))
#define bFM4_CANFD0_TXBTIE_TIE20                  *((volatile  uint8_t *)(0x42E01C50UL))
#define bFM_CANFD0_TXBTIE_TIE21                   *((volatile  uint8_t *)(0x42E01C54UL))
#define bFM4_CANFD0_TXBTIE_TIE21                  *((volatile  uint8_t *)(0x42E01C54UL))
#define bFM_CANFD0_TXBTIE_TIE22                   *((volatile  uint8_t *)(0x42E01C58UL))
#define bFM4_CANFD0_TXBTIE_TIE22                  *((volatile  uint8_t *)(0x42E01C58UL))
#define bFM_CANFD0_TXBTIE_TIE23                   *((volatile  uint8_t *)(0x42E01C5CUL))
#define bFM4_CANFD0_TXBTIE_TIE23                  *((volatile  uint8_t *)(0x42E01C5CUL))
#define bFM_CANFD0_TXBTIE_TIE24                   *((volatile  uint8_t *)(0x42E01C60UL))
#define bFM4_CANFD0_TXBTIE_TIE24                  *((volatile  uint8_t *)(0x42E01C60UL))
#define bFM_CANFD0_TXBTIE_TIE25                   *((volatile  uint8_t *)(0x42E01C64UL))
#define bFM4_CANFD0_TXBTIE_TIE25                  *((volatile  uint8_t *)(0x42E01C64UL))
#define bFM_CANFD0_TXBTIE_TIE26                   *((volatile  uint8_t *)(0x42E01C68UL))
#define bFM4_CANFD0_TXBTIE_TIE26                  *((volatile  uint8_t *)(0x42E01C68UL))
#define bFM_CANFD0_TXBTIE_TIE27                   *((volatile  uint8_t *)(0x42E01C6CUL))
#define bFM4_CANFD0_TXBTIE_TIE27                  *((volatile  uint8_t *)(0x42E01C6CUL))
#define bFM_CANFD0_TXBTIE_TIE28                   *((volatile  uint8_t *)(0x42E01C70UL))
#define bFM4_CANFD0_TXBTIE_TIE28                  *((volatile  uint8_t *)(0x42E01C70UL))
#define bFM_CANFD0_TXBTIE_TIE29                   *((volatile  uint8_t *)(0x42E01C74UL))
#define bFM4_CANFD0_TXBTIE_TIE29                  *((volatile  uint8_t *)(0x42E01C74UL))
#define bFM_CANFD0_TXBTIE_TIE30                   *((volatile  uint8_t *)(0x42E01C78UL))
#define bFM4_CANFD0_TXBTIE_TIE30                  *((volatile  uint8_t *)(0x42E01C78UL))
#define bFM_CANFD0_TXBTIE_TIE31                   *((volatile  uint8_t *)(0x42E01C7CUL))
#define bFM4_CANFD0_TXBTIE_TIE31                  *((volatile  uint8_t *)(0x42E01C7CUL))

#define bFM_CANFD0_TXBTO_TO0                      *((volatile  uint8_t *)(0x42E01B00UL))
#define bFM4_CANFD0_TXBTO_TO0                     *((volatile  uint8_t *)(0x42E01B00UL))
#define bFM_CANFD0_TXBTO_TO1                      *((volatile  uint8_t *)(0x42E01B04UL))
#define bFM4_CANFD0_TXBTO_TO1                     *((volatile  uint8_t *)(0x42E01B04UL))
#define bFM_CANFD0_TXBTO_TO2                      *((volatile  uint8_t *)(0x42E01B08UL))
#define bFM4_CANFD0_TXBTO_TO2                     *((volatile  uint8_t *)(0x42E01B08UL))
#define bFM_CANFD0_TXBTO_TO3                      *((volatile  uint8_t *)(0x42E01B0CUL))
#define bFM4_CANFD0_TXBTO_TO3                     *((volatile  uint8_t *)(0x42E01B0CUL))
#define bFM_CANFD0_TXBTO_TO4                      *((volatile  uint8_t *)(0x42E01B10UL))
#define bFM4_CANFD0_TXBTO_TO4                     *((volatile  uint8_t *)(0x42E01B10UL))
#define bFM_CANFD0_TXBTO_TO5                      *((volatile  uint8_t *)(0x42E01B14UL))
#define bFM4_CANFD0_TXBTO_TO5                     *((volatile  uint8_t *)(0x42E01B14UL))
#define bFM_CANFD0_TXBTO_TO6                      *((volatile  uint8_t *)(0x42E01B18UL))
#define bFM4_CANFD0_TXBTO_TO6                     *((volatile  uint8_t *)(0x42E01B18UL))
#define bFM_CANFD0_TXBTO_TO7                      *((volatile  uint8_t *)(0x42E01B1CUL))
#define bFM4_CANFD0_TXBTO_TO7                     *((volatile  uint8_t *)(0x42E01B1CUL))
#define bFM_CANFD0_TXBTO_TO8                      *((volatile  uint8_t *)(0x42E01B20UL))
#define bFM4_CANFD0_TXBTO_TO8                     *((volatile  uint8_t *)(0x42E01B20UL))
#define bFM_CANFD0_TXBTO_TO9                      *((volatile  uint8_t *)(0x42E01B24UL))
#define bFM4_CANFD0_TXBTO_TO9                     *((volatile  uint8_t *)(0x42E01B24UL))
#define bFM_CANFD0_TXBTO_TO10                     *((volatile  uint8_t *)(0x42E01B28UL))
#define bFM4_CANFD0_TXBTO_TO10                    *((volatile  uint8_t *)(0x42E01B28UL))
#define bFM_CANFD0_TXBTO_TO11                     *((volatile  uint8_t *)(0x42E01B2CUL))
#define bFM4_CANFD0_TXBTO_TO11                    *((volatile  uint8_t *)(0x42E01B2CUL))
#define bFM_CANFD0_TXBTO_TO12                     *((volatile  uint8_t *)(0x42E01B30UL))
#define bFM4_CANFD0_TXBTO_TO12                    *((volatile  uint8_t *)(0x42E01B30UL))
#define bFM_CANFD0_TXBTO_TO13                     *((volatile  uint8_t *)(0x42E01B34UL))
#define bFM4_CANFD0_TXBTO_TO13                    *((volatile  uint8_t *)(0x42E01B34UL))
#define bFM_CANFD0_TXBTO_TO14                     *((volatile  uint8_t *)(0x42E01B38UL))
#define bFM4_CANFD0_TXBTO_TO14                    *((volatile  uint8_t *)(0x42E01B38UL))
#define bFM_CANFD0_TXBTO_TO15                     *((volatile  uint8_t *)(0x42E01B3CUL))
#define bFM4_CANFD0_TXBTO_TO15                    *((volatile  uint8_t *)(0x42E01B3CUL))
#define bFM_CANFD0_TXBTO_TO16                     *((volatile  uint8_t *)(0x42E01B40UL))
#define bFM4_CANFD0_TXBTO_TO16                    *((volatile  uint8_t *)(0x42E01B40UL))
#define bFM_CANFD0_TXBTO_TO17                     *((volatile  uint8_t *)(0x42E01B44UL))
#define bFM4_CANFD0_TXBTO_TO17                    *((volatile  uint8_t *)(0x42E01B44UL))
#define bFM_CANFD0_TXBTO_TO18                     *((volatile  uint8_t *)(0x42E01B48UL))
#define bFM4_CANFD0_TXBTO_TO18                    *((volatile  uint8_t *)(0x42E01B48UL))
#define bFM_CANFD0_TXBTO_TO19                     *((volatile  uint8_t *)(0x42E01B4CUL))
#define bFM4_CANFD0_TXBTO_TO19                    *((volatile  uint8_t *)(0x42E01B4CUL))
#define bFM_CANFD0_TXBTO_TO20                     *((volatile  uint8_t *)(0x42E01B50UL))
#define bFM4_CANFD0_TXBTO_TO20                    *((volatile  uint8_t *)(0x42E01B50UL))
#define bFM_CANFD0_TXBTO_TO21                     *((volatile  uint8_t *)(0x42E01B54UL))
#define bFM4_CANFD0_TXBTO_TO21                    *((volatile  uint8_t *)(0x42E01B54UL))
#define bFM_CANFD0_TXBTO_TO22                     *((volatile  uint8_t *)(0x42E01B58UL))
#define bFM4_CANFD0_TXBTO_TO22                    *((volatile  uint8_t *)(0x42E01B58UL))
#define bFM_CANFD0_TXBTO_TO23                     *((volatile  uint8_t *)(0x42E01B5CUL))
#define bFM4_CANFD0_TXBTO_TO23                    *((volatile  uint8_t *)(0x42E01B5CUL))
#define bFM_CANFD0_TXBTO_TO24                     *((volatile  uint8_t *)(0x42E01B60UL))
#define bFM4_CANFD0_TXBTO_TO24                    *((volatile  uint8_t *)(0x42E01B60UL))
#define bFM_CANFD0_TXBTO_TO25                     *((volatile  uint8_t *)(0x42E01B64UL))
#define bFM4_CANFD0_TXBTO_TO25                    *((volatile  uint8_t *)(0x42E01B64UL))
#define bFM_CANFD0_TXBTO_TO26                     *((volatile  uint8_t *)(0x42E01B68UL))
#define bFM4_CANFD0_TXBTO_TO26                    *((volatile  uint8_t *)(0x42E01B68UL))
#define bFM_CANFD0_TXBTO_TO27                     *((volatile  uint8_t *)(0x42E01B6CUL))
#define bFM4_CANFD0_TXBTO_TO27                    *((volatile  uint8_t *)(0x42E01B6CUL))
#define bFM_CANFD0_TXBTO_TO28                     *((volatile  uint8_t *)(0x42E01B70UL))
#define bFM4_CANFD0_TXBTO_TO28                    *((volatile  uint8_t *)(0x42E01B70UL))
#define bFM_CANFD0_TXBTO_TO29                     *((volatile  uint8_t *)(0x42E01B74UL))
#define bFM4_CANFD0_TXBTO_TO29                    *((volatile  uint8_t *)(0x42E01B74UL))
#define bFM_CANFD0_TXBTO_TO30                     *((volatile  uint8_t *)(0x42E01B78UL))
#define bFM4_CANFD0_TXBTO_TO30                    *((volatile  uint8_t *)(0x42E01B78UL))
#define bFM_CANFD0_TXBTO_TO31                     *((volatile  uint8_t *)(0x42E01B7CUL))
#define bFM4_CANFD0_TXBTO_TO31                    *((volatile  uint8_t *)(0x42E01B7CUL))

#define bFM_CANFD0_TXFQS_TFQF                     *((volatile  uint8_t *)(0x42E018D4UL))
#define bFM4_CANFD0_TXFQS_TFQF                    *((volatile  uint8_t *)(0x42E018D4UL))

#define bFM_CANFD0_TXFS_EFF                       *((volatile  uint8_t *)(0x42E01EE0UL))
#define bFM4_CANFD0_TXFS_EFF                      *((volatile  uint8_t *)(0x42E01EE0UL))
#define bFM_CANFD0_TXFS_TEFL                      *((volatile  uint8_t *)(0x42E01EE4UL))
#define bFM4_CANFD0_TXFS_TEFL                     *((volatile  uint8_t *)(0x42E01EE4UL))


