mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
#define bFM_MFS15_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x4271E080UL))
#define bFM4_MFS15_I2C_IBSR_BB                    *((volatile  uint8_t *)(0x4271E080UL))
#define bFM_MFS15_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x4271E084UL))
#define bFM4_MFS15_I2C_IBSR_SPC                   *((volatile  uint8_t *)(0x4271E084UL))
#define bFM_MFS15_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x4271E088UL))
#define bFM4_MFS15_I2C_IBSR_RSC                   *((volatile  uint8_t *)(0x4271E088UL))
#define bFM_MFS15_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271E08CUL))
#define bFM4_MFS15_I2C_IBSR_AL                    *((volatile  uint8_t *)(0x4271E08CUL))
#define bFM_MFS15_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x4271E090UL))
#define bFM4_MFS15_I2C_IBSR_TRX                   *((volatile  uint8_t *)(0x4271E090UL))
#define bFM_MFS15_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x4271E094UL))
#define bFM4_MFS15_I2C_IBSR_RSA                   *((volatile  uint8_t *)(0x4271E094UL))
#define bFM_MFS15_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x4271E098UL))
#define bFM4_MFS15_I2C_IBSR_RACK                  *((volatile  uint8_t *)(0x4271E098UL))
#define bFM_MFS15_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271E09CUL))
#define bFM4_MFS15_I2C_IBSR_FBT                   *((volatile  uint8_t *)(0x4271E09CUL))

#define bFM_MFS15_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271E21CUL))
#define bFM4_MFS15_I2C_ISBA_SAEN                  *((volatile  uint8_t *)(0x4271E21CUL))

#define bFM_MFS15_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271E23CUL))
#define bFM4_MFS15_I2C_ISMK_EN                    *((volatile  uint8_t *)(0x4271E23CUL))

#define bFM_MFS15_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x4271E008UL))
#define bFM4_MFS15_I2C_SMR_TIE                    *((volatile  uint8_t *)(0x4271E008UL))
#define bFM_MFS15_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271E00CUL))
#define bFM4_MFS15_I2C_SMR_RIE                    *((volatile  uint8_t *)(0x4271E00CUL))

#define bFM_MFS15_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x4271E0A0UL))
#define bFM4_MFS15_I2C_SSR_TBI                    *((volatile  uint8_t *)(0x4271E0A0UL))
#define bFM_MFS15_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x4271E0A4UL))
#define bFM4_MFS15_I2C_SSR_TDRE                   *((volatile  uint8_t *)(0x4271E0A4UL))
#define bFM_MFS15_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x4271E0A8UL))
#define bFM4_MFS15_I2C_SSR_RDRF                   *((volatile  uint8_t *)(0x4271E0A8UL))
#define bFM_MFS15_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x4271E0ACUL))
#define bFM4_MFS15_I2C_SSR_ORE                    *((volatile  uint8_t *)(0x4271E0ACUL))
#define bFM_MFS15_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x4271E0B0UL))
#define bFM4_MFS15_I2C_SSR_TBIE                   *((volatile  uint8_t *)(0x4271E0B0UL))
#define bFM_MFS15_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x4271E0B4UL))
#define bFM4_MFS15_I2C_SSR_DMA                    *((volatile  uint8_t *)(0x4271E0B4UL))
#define bFM_MFS15_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x4271E0B8UL))
#define bFM4_MFS15_I2C_SSR_TSET                   *((volatile  uint8_t *)(0x4271E0B8UL))
#define bFM_MFS15_I2C_SSR_REC                     *((volatile  uint8_t *)(0x4271E0BCUL))
#define bFM4_MFS15_I2C_SSR_REC                    *((volatile  uint8_t *)(0x4271E0BCUL))

#define bFM_MFS15_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x4271E1BCUL))
#define bFM4_MFS15_LIN_BGR_EXT                    *((volatile  uint8_t *)(0x4271E1BCUL))

#define bFM_MFS15_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x4271E090UL))
#define bFM4_MFS15_LIN_ESCR_LBIE                  *((volatile  uint8_t *)(0x4271E090UL))
#define bFM_MFS15_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x4271E098UL))
#define bFM4_MFS15_LIN_ESCR_ESBL                  *((volatile  uint8_t *)(0x4271E098UL))

#define bFM_MFS15_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x4271E280UL))
#define bFM4_MFS15_LIN_FCR_FE1                    *((volatile  uint8_t *)(0x4271E280UL))
#define bFM_MFS15_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x4271E284UL))
#define bFM4_MFS15_LIN_FCR_FE2                    *((volatile  uint8_t *)(0x4271E284UL))
#define bFM_MFS15_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x4271E288UL))
#define bFM4_MFS15_LIN_FCR_FCL1                   *((volatile  uint8_t *)(0x4271E288UL))
#define bFM_MFS15_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271E28CUL))
#define bFM4_MFS15_LIN_FCR_FCL2                   *((volatile  uint8_t *)(0x4271E28CUL))
#define bFM_MFS15_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x4271E290UL))
#define bFM4_MFS15_LIN_FCR_FSET                   *((volatile  uint8_t *)(0x4271E290UL))
#define bFM_MFS15_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x4271E294UL))
#define bFM4_MFS15_LIN_FCR_FLD                    *((volatile  uint8_t *)(0x4271E294UL))
#define bFM_MFS15_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x4271E298UL))
#define bFM4_MFS15_LIN_FCR_FLST                   *((volatile  uint8_t *)(0x4271E298UL))
#define bFM_MFS15_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x4271E2A0UL))
#define bFM4_MFS15_LIN_FCR_FSEL                   *((volatile  uint8_t *)(0x4271E2A0UL))
#define bFM_MFS15_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x4271E2A4UL))
#define bFM4_MFS15_LIN_FCR_FTIE                   *((volatile  uint8_t *)(0x4271E2A4UL))
#define bFM_MFS15_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x4271E2A8UL))
#define bFM4_MFS15_LIN_FCR_FDRQ                   *((volatile  uint8_t *)(0x4271E2A8UL))
#define bFM_MFS15_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x4271E2ACUL))
#define bFM4_MFS15_LIN_FCR_FRIIE                  *((volatile  uint8_t *)(0x4271E2ACUL))
#define bFM_MFS15_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x4271E2B0UL))
#define bFM4_MFS15_LIN_FCR_FLSTE                  *((volatile  uint8_t *)(0x4271E2B0UL))

#define bFM_MFS15_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x4271E020UL))
#define bFM4_MFS15_LIN_SCR_TXE                    *((volatile  uint8_t *)(0x4271E020UL))
#define bFM_MFS15_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x4271E024UL))
#define bFM4_MFS15_LIN_SCR_RXE                    *((volatile  uint8_t *)(0x4271E024UL))
#define bFM_MFS15_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x4271E028UL))
#define bFM4_MFS15_LIN_SCR_TBIE                   *((volatile  uint8_t *)(0x4271E028UL))
#define bFM_MFS15_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271E02CUL))
#define bFM4_MFS15_LIN_SCR_TIE                    *((volatile  uint8_t *)(0x4271E02CUL))
#define bFM_MFS15_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x4271E030UL))
#define bFM4_MFS15_LIN_SCR_RIE                    *((volatile  uint8_t *)(0x4271E030UL))
#define bFM_MFS15_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x4271E034UL))
#define bFM4_MFS15_LIN_SCR_LBR                    *((volatile  uint8_t *)(0x4271E034UL))
#define bFM_MFS15_LIN_SCR_MS                      *((volatile  uint8_t *)(0x4271E038UL))
#define bFM4_MFS15_LIN_SCR_MS                     *((volatile  uint8_t *)(0x4271E038UL))
#define bFM_MFS15_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271E03CUL))
#define bFM4_MFS15_LIN_SCR_UPCL                   *((volatile  uint8_t *)(0x4271E03CUL))

