mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/common/s6e2c4xh.h
#define bFM_SDIF_SEINTST_CMDTOERR                 *((volatile  uint8_t *)(0x42DC0640UL))
#define bFM4_SDIF_SEINTST_CMDTOERR                *((volatile  uint8_t *)(0x42DC0640UL))
#define bFM_SDIF_SEINTST_CMDCRCERR                *((volatile  uint8_t *)(0x42DC0644UL))
#define bFM4_SDIF_SEINTST_CMDCRCERR               *((volatile  uint8_t *)(0x42DC0644UL))
#define bFM_SDIF_SEINTST_CMDEBERR                 *((volatile  uint8_t *)(0x42DC0648UL))
#define bFM4_SDIF_SEINTST_CMDEBERR                *((volatile  uint8_t *)(0x42DC0648UL))
#define bFM_SDIF_SEINTST_CMDIDXERR                *((volatile  uint8_t *)(0x42DC064CUL))
#define bFM4_SDIF_SEINTST_CMDIDXERR               *((volatile  uint8_t *)(0x42DC064CUL))
#define bFM_SDIF_SEINTST_DTTOERR                  *((volatile  uint8_t *)(0x42DC0650UL))
#define bFM4_SDIF_SEINTST_DTTOERR                 *((volatile  uint8_t *)(0x42DC0650UL))
#define bFM_SDIF_SEINTST_DTCRCERR                 *((volatile  uint8_t *)(0x42DC0654UL))
#define bFM4_SDIF_SEINTST_DTCRCERR                *((volatile  uint8_t *)(0x42DC0654UL))
#define bFM_SDIF_SEINTST_DTEBERR                  *((volatile  uint8_t *)(0x42DC0658UL))
#define bFM4_SDIF_SEINTST_DTEBERR                 *((volatile  uint8_t *)(0x42DC0658UL))
#define bFM_SDIF_SEINTST_CRTLMTERR                *((volatile  uint8_t *)(0x42DC065CUL))
#define bFM4_SDIF_SEINTST_CRTLMTERR               *((volatile  uint8_t *)(0x42DC065CUL))
#define bFM_SDIF_SEINTST_ACMD12ERR                *((volatile  uint8_t *)(0x42DC0660UL))
#define bFM4_SDIF_SEINTST_ACMD12ERR               *((volatile  uint8_t *)(0x42DC0660UL))
#define bFM_SDIF_SEINTST_ADMAERR                  *((volatile  uint8_t *)(0x42DC0664UL))
#define bFM4_SDIF_SEINTST_ADMAERR                 *((volatile  uint8_t *)(0x42DC0664UL))
#define bFM_SDIF_SEINTST_TUNINGERR                *((volatile  uint8_t *)(0x42DC0668UL))
#define bFM4_SDIF_SEINTST_TUNINGERR               *((volatile  uint8_t *)(0x42DC0668UL))
#define bFM_SDIF_SEINTST_BTACKERR                 *((volatile  uint8_t *)(0x42DC0670UL))
#define bFM4_SDIF_SEINTST_BTACKERR                *((volatile  uint8_t *)(0x42DC0670UL))
#define bFM_SDIF_SEINTST_ACMD19ERR                *((volatile  uint8_t *)(0x42DC0674UL))
#define bFM4_SDIF_SEINTST_ACMD19ERR               *((volatile  uint8_t *)(0x42DC0674UL))
#define bFM_SDIF_SEINTST_AHBMSTERR                *((volatile  uint8_t *)(0x42DC0678UL))
#define bFM4_SDIF_SEINTST_AHBMSTERR               *((volatile  uint8_t *)(0x42DC0678UL))

#define bFM_SDIF_SEINTSTE_CMDTOERRS               *((volatile  uint8_t *)(0x42DC06C0UL))
#define bFM4_SDIF_SEINTSTE_CMDTOERRS              *((volatile  uint8_t *)(0x42DC06C0UL))
#define bFM_SDIF_SEINTSTE_CMDCRCERRS              *((volatile  uint8_t *)(0x42DC06C4UL))
#define bFM4_SDIF_SEINTSTE_CMDCRCERRS             *((volatile  uint8_t *)(0x42DC06C4UL))
#define bFM_SDIF_SEINTSTE_CMDEBERRS               *((volatile  uint8_t *)(0x42DC06C8UL))
#define bFM4_SDIF_SEINTSTE_CMDEBERRS              *((volatile  uint8_t *)(0x42DC06C8UL))
#define bFM_SDIF_SEINTSTE_CMDIDXERRS              *((volatile  uint8_t *)(0x42DC06CCUL))
#define bFM4_SDIF_SEINTSTE_CMDIDXERRS             *((volatile  uint8_t *)(0x42DC06CCUL))
#define bFM_SDIF_SEINTSTE_DTTOERRS                *((volatile  uint8_t *)(0x42DC06D0UL))
#define bFM4_SDIF_SEINTSTE_DTTOERRS               *((volatile  uint8_t *)(0x42DC06D0UL))
#define bFM_SDIF_SEINTSTE_DTCRCERRS               *((volatile  uint8_t *)(0x42DC06D4UL))
#define bFM4_SDIF_SEINTSTE_DTCRCERRS              *((volatile  uint8_t *)(0x42DC06D4UL))
#define bFM_SDIF_SEINTSTE_DTEBERRS                *((volatile  uint8_t *)(0x42DC06D8UL))
#define bFM4_SDIF_SEINTSTE_DTEBERRS               *((volatile  uint8_t *)(0x42DC06D8UL))
#define bFM_SDIF_SEINTSTE_CRTLMTERRS              *((volatile  uint8_t *)(0x42DC06DCUL))
#define bFM4_SDIF_SEINTSTE_CRTLMTERRS             *((volatile  uint8_t *)(0x42DC06DCUL))
#define bFM_SDIF_SEINTSTE_ACMD12ERRS              *((volatile  uint8_t *)(0x42DC06E0UL))
#define bFM4_SDIF_SEINTSTE_ACMD12ERRS             *((volatile  uint8_t *)(0x42DC06E0UL))
#define bFM_SDIF_SEINTSTE_ADMAERRS                *((volatile  uint8_t *)(0x42DC06E4UL))
#define bFM4_SDIF_SEINTSTE_ADMAERRS               *((volatile  uint8_t *)(0x42DC06E4UL))
#define bFM_SDIF_SEINTSTE_TUNINGERRS              *((volatile  uint8_t *)(0x42DC06E8UL))
#define bFM4_SDIF_SEINTSTE_TUNINGERRS             *((volatile  uint8_t *)(0x42DC06E8UL))
#define bFM_SDIF_SEINTSTE_BTACKERRS               *((volatile  uint8_t *)(0x42DC06F0UL))
#define bFM4_SDIF_SEINTSTE_BTACKERRS              *((volatile  uint8_t *)(0x42DC06F0UL))
#define bFM_SDIF_SEINTSTE_ACMD19ERRS              *((volatile  uint8_t *)(0x42DC06F4UL))
#define bFM4_SDIF_SEINTSTE_ACMD19ERRS             *((volatile  uint8_t *)(0x42DC06F4UL))
#define bFM_SDIF_SEINTSTE_AHBMSTERRS              *((volatile  uint8_t *)(0x42DC06F8UL))
#define bFM4_SDIF_SEINTSTE_AHBMSTERRS             *((volatile  uint8_t *)(0x42DC06F8UL))

#define bFM_SDIF_SFEEIST_FETOERR                  *((volatile  uint8_t *)(0x42DC0A40UL))
#define bFM4_SDIF_SFEEIST_FETOERR                 *((volatile  uint8_t *)(0x42DC0A40UL))
#define bFM_SDIF_SFEEIST_FECRCERR                 *((volatile  uint8_t *)(0x42DC0A44UL))
#define bFM4_SDIF_SFEEIST_FECRCERR                *((volatile  uint8_t *)(0x42DC0A44UL))
#define bFM_SDIF_SFEEIST_FEEBERR                  *((volatile  uint8_t *)(0x42DC0A48UL))
#define bFM4_SDIF_SFEEIST_FEEBERR                 *((volatile  uint8_t *)(0x42DC0A48UL))
#define bFM_SDIF_SFEEIST_FEIDXERR                 *((volatile  uint8_t *)(0x42DC0A4CUL))
#define bFM4_SDIF_SFEEIST_FEIDXERR                *((volatile  uint8_t *)(0x42DC0A4CUL))
#define bFM_SDIF_SFEEIST_FEDTOTERR                *((volatile  uint8_t *)(0x42DC0A50UL))
#define bFM4_SDIF_SFEEIST_FEDTOTERR               *((volatile  uint8_t *)(0x42DC0A50UL))
#define bFM_SDIF_SFEEIST_FEDTCRCERR               *((volatile  uint8_t *)(0x42DC0A54UL))
#define bFM4_SDIF_SFEEIST_FEDTCRCERR              *((volatile  uint8_t *)(0x42DC0A54UL))
#define bFM_SDIF_SFEEIST_FEDTEBERR                *((volatile  uint8_t *)(0x42DC0A58UL))
#define bFM4_SDIF_SFEEIST_FEDTEBERR               *((volatile  uint8_t *)(0x42DC0A58UL))
#define bFM_SDIF_SFEEIST_FECRLTERR                *((volatile  uint8_t *)(0x42DC0A5CUL))
#define bFM4_SDIF_SFEEIST_FECRLTERR               *((volatile  uint8_t *)(0x42DC0A5CUL))
#define bFM_SDIF_SFEEIST_FEA12ERR                 *((volatile  uint8_t *)(0x42DC0A60UL))
#define bFM4_SDIF_SFEEIST_FEA12ERR                *((volatile  uint8_t *)(0x42DC0A60UL))
#define bFM_SDIF_SFEEIST_FEADMAERR                *((volatile  uint8_t *)(0x42DC0A64UL))
#define bFM4_SDIF_SFEEIST_FEADMAERR               *((volatile  uint8_t *)(0x42DC0A64UL))
#define bFM_SDIF_SFEEIST_FETUNEERR                *((volatile  uint8_t *)(0x42DC0A68UL))
#define bFM4_SDIF_SFEEIST_FETUNEERR               *((volatile  uint8_t *)(0x42DC0A68UL))
#define bFM_SDIF_SFEEIST_FEACKERR                 *((volatile  uint8_t *)(0x42DC0A70UL))
#define bFM4_SDIF_SFEEIST_FEACKERR                *((volatile  uint8_t *)(0x42DC0A70UL))
#define bFM_SDIF_SFEEIST_FEA19ERR                 *((volatile  uint8_t *)(0x42DC0A74UL))
#define bFM4_SDIF_SFEEIST_FEA19ERR                *((volatile  uint8_t *)(0x42DC0A74UL))
#define bFM_SDIF_SFEEIST_FEAHBMSERR               *((volatile  uint8_t *)(0x42DC0A78UL))
#define bFM4_SDIF_SFEEIST_FEAHBMSERR              *((volatile  uint8_t *)(0x42DC0A78UL))

#define bFM_SDIF_SHCTL1_LEDCTRL                   *((volatile  uint8_t *)(0x42DC0500UL))
#define bFM4_SDIF_SHCTL1_LEDCTRL                  *((volatile  uint8_t *)(0x42DC0500UL))
#define bFM_SDIF_SHCTL1_DATAWIDTH                 *((volatile  uint8_t *)(0x42DC0504UL))
#define bFM4_SDIF_SHCTL1_DATAWIDTH                *((volatile  uint8_t *)(0x42DC0504UL))
#define bFM_SDIF_SHCTL1_HIGHSPDEN                 *((volatile  uint8_t *)(0x42DC0508UL))
#define bFM4_SDIF_SHCTL1_HIGHSPDEN                *((volatile  uint8_t *)(0x42DC0508UL))
#define bFM_SDIF_SHCTL1_EXTDTWIDTH                *((volatile  uint8_t *)(0x42DC0514UL))
#define bFM4_SDIF_SHCTL1_EXTDTWIDTH               *((volatile  uint8_t *)(0x42DC0514UL))
#define bFM_SDIF_SHCTL1_CDTSTLVL                  *((volatile  uint8_t *)(0x42DC0518UL))
#define bFM4_SDIF_SHCTL1_CDTSTLVL                 *((volatile  uint8_t *)(0x42DC0518UL))
#define bFM_SDIF_SHCTL1_CDSGNSEL                  *((volatile  uint8_t *)(0x42DC051CUL))
#define bFM4_SDIF_SHCTL1_CDSGNSEL                 *((volatile  uint8_t *)(0x42DC051CUL))

